{
	"symbol": "AD.DB.B",
	"name": "Alaris Equity Partners Income Trust 6.50% Convertible Unsecured Senior Debentures",
	"price": 102,
	"priceChange": 0.03,
	"percentChange": 0.02942,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 255000,
	"openPrice": 101.97,
	"dayHigh": 102,
	"dayLow": 101.97,
	"MarketCap": 93840000,
	"MarketCapAllClasses": 4648675398,
	"peRatio": 4.65,
	"prevClose": 101.97,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": null,
	"eps": 4.03,
	"exDividendDate": "",
	"longDescription": "Alaris Equity Partners Income Trust is a private equity firm specializing in management buyouts, growth capital, lower & middle market, later stage, industry consolidation, growth capital, and mature investments. The firm does not invest in turnarounds and start-ups. It prefers to invest in the companies based in all industries except for those with a declining asset base, such as oil and gas resource companies, or any industry that carry the risk of obsolescence such as high tech and focuses on business services, professional services, information services, healthcare services, distribution & logistics, industrials, consumer products. The firm seeks to invest in companies raising capital for a partial liquidity, generational transfer, recapitalization, and growth and who do not want to give up control or chance the added risk that comes with high leverage levels. It prefers to invest in companies that are mostly individual or family controlled.",
	"fulldescription": "Alaris Equity Partners Income Trust is a private equity firm specializing in management buyouts, growth capital, lower & middle market, later stage, industry consolidation, growth capital, and mature investments. The firm does not invest in turnarounds and start-ups. It prefers to invest in the companies based in all industries except for those with a declining asset base, such as oil and gas resource companies, or any industry that carry the risk of obsolescence such as high tech and focuses on business services, professional services, information services, healthcare services, distribution & logistics, industrials, consumer products. The firm seeks to invest in companies raising capital for a partial liquidity, generational transfer, recapitalization, and growth and who do not want to give up control or chance the added risk that comes with high leverage levels. It prefers to invest in companies that are mostly individual or family controlled. The firm typically provides alternative financing for a diversified group of private businesses ('Private Company Partners') in exchange for royalties or distributions from the Private Company Partners, with the principal objective of generating stable and predictable cash flows for dividend payments to its shareholders. It seeks to invest in the companies based in Europe, North America with the focus on Canada, and United States. It typically invests between $5 million and $100 million in companies with an enterprise values between $10 million and $400 million and EBITDA between $5 million and $50 million, historical EBITDA in excess of $10 million, and Low levels of debt and capital expenditure. The firm also makes small cap investments upto $20 million in private companies that have historical EBITDA in excess of $2 million. However, for larger companies, transactions can be structured to include additional investments. The firm seeks to invest in industries that do not experience large cyclical swings. It does not own any shares and does not require board representation. The firm invests through balance sheet and seeks equity dividend distribution from portfolios. It prefers to make non control equity, minority and majority investments in its portfolio companies. Alaris Royalty Corp. was founded in 2008 and is based in Calgary, Canada.",
	"website": "https://www.alarisequitypartners.com",
	"email": "ir@alarisroyalty.com",
	"phoneNumber": "",
	"fullAddress": "250, 333 - 24th Avenue SW, CA",
	"employees": "20",
	"shareOutStanding": 920000,
	"totalDebtToEquity": 0.06,
	"totalSharesOutStanding": 45575249,
	"sharesESCROW": null,
	"vwap": 101.999254,
	"dividendPayDate": null,
	"weeks52high": 102.6,
	"weeks52low": 99.5,
	"alpha": null,
	"averageVolume10D": 96800,
	"averageVolume20D": 199950,
	"averageVolume30D": 407600,
	"averageVolume50D": 244560,
	"priceToBook": 0.79,
	"priceToCashFlow": 11.3,
	"returnOnEquity": 17.54,
	"returnOnAssets": 16.14,
	"day21MovingAvg": 101.40143,
	"day50MovingAvg": 101.25792,
	"day200MovingAvg": 101.25792,
	"dividend3Years": 1.52,
	"dividend5Years": -2.58,
	"datatype": "equity",
	"issueType": "DB",
	"close": 102,
	"qmdescription": "",
	"__typename": "Company"
}