{
	"symbol": "ARB",
	"name": "Accelerate Arbitrage Fund",
	"price": 27.61,
	"priceChange": -0.06,
	"percentChange": -0.216841,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 26229500,
	"MarketCapAllClasses": 0,
	"peRatio": 14.76,
	"prevClose": 27.67,
	"dividendFrequency": "Quarterly",
	"dividendYield": 3.749,
	"dividendAmount": 0.26,
	"dividendCurrency": "CAD",
	"beta": 0.074544,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "The investment objective of the Accelerate Arbitrage Fund the Fund, ARB is to achieve long term capital appreciation and a superior risk-adjusted return relative to the S&P Merger Arbitrage Index... The Fund ARB seeks to outperform the S&P Merger Arbitrage Index through an arbitrage investment strategy by investing primarily in listed equity, debt or derivative securities of target companies involved in mergers or corporate actions, while selling short certain listed equity, debt or derivative securities of acquirer companies involved in mergers or corporate actions, where applicable. The aggregate notional amount of derivatives used for non-hedging purposes will not exceed the limits permitted under applicable securities legislation.",
	"fulldescription": "The investment objective of the Accelerate Arbitrage Fund the Fund, ARB is to achieve long term capital appreciation and a superior risk-adjusted return relative to the S&P Merger Arbitrage Index... The Fund ARB seeks to outperform the S&P Merger Arbitrage Index through an arbitrage investment strategy by investing primarily in listed equity, debt or derivative securities of target companies involved in mergers or corporate actions, while selling short certain listed equity, debt or derivative securities of acquirer companies involved in mergers or corporate actions, where applicable. The aggregate notional amount of derivatives used for non-hedging purposes will not exceed the limits permitted under applicable securities legislation. ARB has obtained exemptive relief to permit it to sell securities short up to an aggregate market value of 100% of ARBs NAV. In order to achieve its investment objective, ARB engages in a merger arbitrage investment strategy by investing in long positions in listed equity, debt or derivative securities of target companies involved in mergers or corporate actions, while selling short certain listed equity, debt or derivative securities of acquirer com",
	"website": "www.AccelerateShares.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "Suite 300, 524 17 Avenue SW, Calgary, Alberta, T2S 0B2, CA",
	"employees": "",
	"shareOutStanding": 950000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2025-07-08",
	"weeks52high": 28.1,
	"weeks52low": 24.995346,
	"alpha": 0.006505,
	"averageVolume10D": 893,
	"averageVolume20D": 3096,
	"averageVolume30D": 2111,
	"averageVolume50D": 1489,
	"priceToBook": 2.99,
	"priceToCashFlow": "",
	"returnOnEquity": -0.88,
	"returnOnAssets": -0.01,
	"day21MovingAvg": 27.521757,
	"day50MovingAvg": 27.249027,
	"day200MovingAvg": 26.094957,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 27.74,
	"qmdescription": "",
	"__typename": "Company"
}