{
	"symbol": "ATSX",
	"name": "Accelerate Canadian Long Short Equity Fund",
	"price": 26.51,
	"priceChange": -0.37,
	"percentChange": -1.376488,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 2651000,
	"MarketCapAllClasses": 0,
	"peRatio": 4.59,
	"prevClose": 26.88,
	"dividendFrequency": "Quarterly",
	"dividendYield": 6.218,
	"dividendAmount": 0.42,
	"dividendCurrency": "CAD",
	"beta": 0.938611,
	"eps": null,
	"exDividendDate": "2024-03-27 00:00:00.0",
	"longDescription": "The investment objective of the Accelerate Enhanced Canadian Benchmark Alternative Fund (the Fund, ATSX) is to achieve long-term capital appreciation and a superior risk-adjusted return relative to the broader Canadian equity market.. The Fund In order to achieve its investment objective, ATSX invests directly or indirectly primarily in the equity securities of Canadian and foreign issuers listed on an exchange or marketplace in Canada that represent the broad Canadian listed equities market. In addition, ATSX invests in a long-short equity overlay portfolio by investing in up to a 50% short portfolio overlay and using the cash generated from these short positions to purchase an additional approximately 50 Percentage long portfolio overlay. While the short positions create leverage by increasing the long portfolio exposure, these positions help to hedge the increased market risk associated with the leveraged portion of its portfolio.",
	"fulldescription": "The investment objective of the Accelerate Enhanced Canadian Benchmark Alternative Fund (the Fund, ATSX) is to achieve long-term capital appreciation and a superior risk-adjusted return relative to the broader Canadian equity market.. The Fund In order to achieve its investment objective, ATSX invests directly or indirectly primarily in the equity securities of Canadian and foreign issuers listed on an exchange or marketplace in Canada that represent the broad Canadian listed equities market. In addition, ATSX invests in a long-short equity overlay portfolio by investing in up to a 50% short portfolio overlay and using the cash generated from these short positions to purchase an additional approximately 50 Percentage long portfolio overlay. While the short positions create leverage by increasing the long portfolio exposure, these positions help to hedge the increased market risk associated with the leveraged portion of its portfolio. The aggregate market value of the securities sold short will not exceed 50 Percentage of ATSXs NAV. Security selection of the long and short portfolio overlay is driven by an integrated multi-factor approach, consistent with empirical data and financial theory, based on factors that inc",
	"website": "www.AccelerateShares.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "Suite 300, 524 17 Avenue SW, Calgary, Alberta, T2S 0B2, CA",
	"employees": "",
	"shareOutStanding": 100000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2024-04-10",
	"weeks52high": 27.02,
	"weeks52low": 21.343485,
	"alpha": 0.005243,
	"averageVolume10D": 20,
	"averageVolume20D": 31,
	"averageVolume30D": 23,
	"averageVolume50D": 205,
	"priceToBook": 1.49,
	"priceToCashFlow": 6.9,
	"returnOnEquity": 17.38,
	"returnOnAssets": 6.05,
	"day21MovingAvg": 26.315714,
	"day50MovingAvg": 25.6902,
	"day200MovingAvg": 24.32702,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "CE",
	"close": 27.02,
	"qmdescription": "",
	"__typename": "Company"
}