{
	"symbol": "CBNK",
	"name": "Mulvihill Canadian Bank Enhanced Yield ETF",
	"price": 9.08,
	"priceChange": -0.01,
	"percentChange": -0.110011,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 7216,
	"openPrice": 9.08,
	"dayHigh": 9.1,
	"dayLow": 9.08,
	"MarketCap": 107598000,
	"MarketCapAllClasses": 0,
	"peRatio": 8.4,
	"prevClose": 9.09,
	"dividendFrequency": "Monthly",
	"dividendYield": 7.709,
	"dividendAmount": 0.058333,
	"dividendCurrency": "CAD",
	"beta": 1.292766,
	"eps": null,
	"exDividendDate": "2025-07-31 00:00:00.0",
	"longDescription": "The Fund seeks to provide unitholders with long-term capital appreciation. The Fund through exposure to a portfolio consisting primarily of common shares of Bank of Montreal, The Bank of Nova Scotia, Canadian Imperial Bank of Commerce, National Bank of Canada, Royal Bank of Canada and The Toronto-Dominion Bank collectively, the Banks and monthly cash distributions. To accomplish its objectives, the Fund invests substantially all of its assets in common shares of the Banks. Modest leverage of 25 percent enhances the dividend yields of the underlying stocks and provides additional return potential. The Fund will also utilize option strategies to enhance the portfolio income. In addition, the Fund may purchase public investment funds including exchange-traded funds and other Mulvihill Funds that provide exposure to such common shares. The Fund employs an active covered call writing strategy to enhance the income generated by the portfolio and to reduce volatility.",
	"fulldescription": "The Fund seeks to provide unitholders with long-term capital appreciation. The Fund through exposure to a portfolio consisting primarily of common shares of Bank of Montreal, The Bank of Nova Scotia, Canadian Imperial Bank of Commerce, National Bank of Canada, Royal Bank of Canada and The Toronto-Dominion Bank collectively, the Banks and monthly cash distributions. To accomplish its objectives, the Fund invests substantially all of its assets in common shares of the Banks. Modest leverage of 25 percent enhances the dividend yields of the underlying stocks and provides additional return potential. The Fund will also utilize option strategies to enhance the portfolio income. In addition, the Fund may purchase public investment funds including exchange-traded funds and other Mulvihill Funds that provide exposure to such common shares. The Fund employs an active covered call writing strategy to enhance the income generated by the portfolio and to reduce volatility. In addition, the Fund may write cash covered put options in respect of securities in which it is permitted to invest.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 11850000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 9.08416666,
	"dividendPayDate": "2025-08-07",
	"weeks52high": 9.1,
	"weeks52low": 6.9,
	"alpha": -0.001949,
	"averageVolume10D": 11453,
	"averageVolume20D": 12043,
	"averageVolume30D": 11208,
	"averageVolume50D": 12089,
	"priceToBook": 0.79,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 8.732888,
	"day50MovingAvg": 8.424811,
	"day200MovingAvg": 8.018716,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 9.08,
	"qmdescription": "",
	"__typename": "Company"
}