{
	"symbol": "CCEI",
	"name": "CIBC Canadian Equity Index ETF",
	"price": 29.38,
	"priceChange": 0,
	"percentChange": 0,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 8600,
	"openPrice": 29.39,
	"dayHigh": 29.39,
	"dayLow": 29.38,
	"MarketCap": 465761140,
	"MarketCapAllClasses": 0,
	"peRatio": 19.14,
	"prevClose": 29.38,
	"dividendFrequency": "Quarterly",
	"dividendYield": 2.218,
	"dividendAmount": 0.186,
	"dividendCurrency": "CAD",
	"beta": 0.976318,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "The ETF seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of a broad Canadian equity market index that measures the investment return of publicly traded securities in the Canadian market. Currently, this CIBC ETF seeks to track the Morningstar Canada Domestic Index. to achieve their investment objectives and to obtain exposure to the Constituent Securities of the applicable Index, the CIBC Index ETFs: ¿ invest in and hold the Constituent Securities of the applicable Index in approximately the same proportion as they are reflected in that Index. may, in certain circumstances and at the discretion of the Manager or Portfolio Advisor, employ a sampling strategy.",
	"fulldescription": "The ETF seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of a broad Canadian equity market index that measures the investment return of publicly traded securities in the Canadian market. Currently, this CIBC ETF seeks to track the Morningstar Canada Domestic Index. to achieve their investment objectives and to obtain exposure to the Constituent Securities of the applicable Index, the CIBC Index ETFs: ¿ invest in and hold the Constituent Securities of the applicable Index in approximately the same proportion as they are reflected in that Index. may, in certain circumstances and at the discretion of the Manager or Portfolio Advisor, employ a sampling strategy. Under a sampling strategy, such CIBC Index ETF may not hold all of the Constituent Securities that are included in the applicable Index, but instead will hold a portfolio of Constituent Securities and/or Other Securities selected by the Manager or the Portfolio Advisor that closely matches the aggregate investment characteristics of the Constituent Securities included in the applicable Index. The Other Securities, if any, selected using such sampling methodology will be based on a number of factors (e.g., market cap, industry sector, weightings, etc.), including the asset base of the CIBC Index ETF.",
	"website": "www.renaissanceinvestments.ca",
	"email": "",
	"phoneNumber": "(416) 364-5620",
	"fullAddress": "161 Bay Street, Suite 2230, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 15853000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 29.3815116,
	"dividendPayDate": "2025-07-07",
	"weeks52high": 29.41,
	"weeks52low": 23.185946,
	"alpha": 0.004453,
	"averageVolume10D": 7497,
	"averageVolume20D": 6180,
	"averageVolume30D": 6419,
	"averageVolume50D": 6119,
	"priceToBook": 1.72,
	"priceToCashFlow": 8.2,
	"returnOnEquity": 13.56,
	"returnOnAssets": 4.05,
	"day21MovingAvg": 28.903982,
	"day50MovingAvg": 28.216595,
	"day200MovingAvg": 26.923119,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 29.4,
	"qmdescription": "",
	"__typename": "Company"
}