{
	"symbol": "CDNA",
	"name": "CI Bio-Revolution Index ETF",
	"price": 16.16,
	"priceChange": -0.16,
	"percentChange": -0.980392,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 5656000,
	"MarketCapAllClasses": 0,
	"peRatio": 29.56,
	"prevClose": 16.32,
	"dividendFrequency": "Quarterly",
	"dividendYield": 0.41,
	"dividendAmount": 0.0222,
	"dividendCurrency": "CAD",
	"beta": 1.232491,
	"eps": null,
	"exDividendDate": "2024-09-30 00:00:00.0",
	"longDescription": "The investment objective of the CI Bio Revolution ETF the Fund is to replicate, to the extent reasonably possible the performance of the Solactive Global Genomics Immunology and Medical Revolution CAD Hedged Index NTR the Index. The Fund The Index intends to track the performance of companies that have business operations in the global biotechnology and genomics industry using the ARTIS classification system. The Index hedges foreign currency exposure back to Canadian dollars. The Fund invests in and holds, to the extent reasonably possible, the constituent securities of the Index in substantially the same proportion as they are reflected in the Index. The Fund may use a sampling strategy in selecting its investments to achieve its objective.",
	"fulldescription": "The investment objective of the CI Bio Revolution ETF the Fund is to replicate, to the extent reasonably possible the performance of the Solactive Global Genomics Immunology and Medical Revolution CAD Hedged Index NTR the Index. The Fund The Index intends to track the performance of companies that have business operations in the global biotechnology and genomics industry using the ARTIS classification system. The Index hedges foreign currency exposure back to Canadian dollars. The Fund invests in and holds, to the extent reasonably possible, the constituent securities of the Index in substantially the same proportion as they are reflected in the Index. The Fund may use a sampling strategy in selecting its investments to achieve its objective. The Fund may also use quantitative analysis to select securities from the Index to obtain a representative sample of securities that resemble the Index in terms of key risk factors, performance attributes, industry weightings, market capitalization and other appropriate financial characteristics. The quantity of constituent securities selected using such sampling methodology will be based on a number of factors, including the asset base of the Fund.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CI Global Asset Management, CA",
	"employees": "",
	"shareOutStanding": 350000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": null,
	"weeks52high": 18.069196,
	"weeks52low": 15.080748,
	"alpha": -0.008431,
	"averageVolume10D": 1050,
	"averageVolume20D": 525,
	"averageVolume30D": 650,
	"averageVolume50D": 392,
	"priceToBook": 3.93,
	"priceToCashFlow": 13.5,
	"returnOnEquity": 2.1,
	"returnOnAssets": -5.22,
	"day21MovingAvg": 16.818094,
	"day50MovingAvg": 17.143005,
	"day200MovingAvg": 16.897652,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 16.55,
	"qmdescription": "",
	"__typename": "Company"
}