{
	"symbol": "CNL",
	"name": "Collective Mining Ltd.",
	"price": 16.42,
	"priceChange": 0.57,
	"percentChange": 3.596215,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Materials",
	"industry": "Mining",
	"volume": 36876,
	"openPrice": 15.7,
	"dayHigh": 16.45,
	"dayLow": 15.7,
	"MarketCap": 1393303107,
	"MarketCapAllClasses": 1393193635,
	"peRatio": "",
	"prevClose": 15.85,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": 0.603665,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "Collective Mining is an exploration and development company focused on identifying and exploring prospective mineral projects in South America. Founded by the team that developed and sold Continental Gold Inc. to Zijin Mining for approximately $2 billion in enterprise value, the mission of the Company is to repeat its past success in Colombia by making a significant new mineral discovery and advancing the projection to production. Management, insiders and close family and friends own approximately 40% of the outstanding shares of the Company and as a result, are fully aligned with shareholders. Collective currently holds an option to earn up to a 100% interest in two projects located in Colombia. As a result of an aggressive exploration program at both the Guayabales and San Antonio projects a total of eleven major targets have been defined. The Company is fortuitous to have made significant grassroots discoveries on both projects with discovery holes of 302 metres 1.",
	"fulldescription": "Collective Mining is an exploration and development company focused on identifying and exploring prospective mineral projects in South America. Founded by the team that developed and sold Continental Gold Inc. to Zijin Mining for approximately $2 billion in enterprise value, the mission of the Company is to repeat its past success in Colombia by making a significant new mineral discovery and advancing the projection to production. Management, insiders and close family and friends own approximately 40% of the outstanding shares of the Company and as a result, are fully aligned with shareholders. Collective currently holds an option to earn up to a 100% interest in two projects located in Colombia. As a result of an aggressive exploration program at both the Guayabales and San Antonio projects a total of eleven major targets have been defined. The Company is fortuitous to have made significant grassroots discoveries on both projects with discovery holes of 302 metres 1.1 g/t AuEq and 104 metres @ 1.3 g/t AuEq at the Guayabales project and 710 metres @ 0.53 AuEq at the San Antonio project.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "130 King Street West,Suite 2210, Toronto, ON, CA",
	"employees": "84",
	"shareOutStanding": 84854026,
	"totalDebtToEquity": 0.02,
	"totalSharesOutStanding": 84847359,
	"sharesESCROW": 6290600,
	"vwap": 16.1679501,
	"dividendPayDate": null,
	"weeks52high": 16.45,
	"weeks52low": 3.14,
	"alpha": 0.04117,
	"averageVolume10D": 133781,
	"averageVolume20D": 129885,
	"averageVolume30D": 158054,
	"averageVolume50D": 154103,
	"priceToBook": 12.95,
	"priceToCashFlow": -47,
	"returnOnEquity": -78.39,
	"returnOnAssets": -71.14,
	"day21MovingAvg": 14.36,
	"day50MovingAvg": 14.2722,
	"day200MovingAvg": 9.2327,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "equity",
	"issueType": "CS",
	"close": 16.42,
	"qmdescription": "Gold",
	"__typename": "Company"
}