{
	"symbol": "CUP.RT.U",
	"name": "Caribbean Utilities Company Ltd. rights",
	"price": 0.005,
	"priceChange": 0,
	"percentChange": 0,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": "TSX",
	"sector": "Utilities",
	"industry": "Regulated Utilities",
	"volume": null,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 191115,
	"MarketCapAllClasses": 190804,
	"peRatio": 13.28,
	"prevClose": 0.005,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": null,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "Cardiol Therapeutics Inc. is a clinical-stage life sciences company focused on the research and clinical development of cannabidiol as an anti-fibrotic anti-inflammatory therapy for the treatment of cardiovascular disease CVD. The Companys lead product candidate CardiolRx is a pharmaceutically produced oral cannabidiol formulation that is being clinically developed for use in cardiovascular medicine. CardiolRx is currently being evaluated in a Phase II III multi-national randomized double-blind placebo-controlled study the LANCER trial. LANCER is designed to evaluate the efficacy and safety of CardiolRx as a cardioprotective therapy to reduce major cardiovascular and respiratory events in patients hospitalized with COVID 19 who have a prior history of or risk factors for CVD and to investigate the influence CardiolRx has on key biomarkers associated with heart disease.",
	"fulldescription": "Cardiol Therapeutics Inc. is a clinical-stage life sciences company focused on the research and clinical development of cannabidiol as an anti-fibrotic anti-inflammatory therapy for the treatment of cardiovascular disease CVD. The Companys lead product candidate CardiolRx is a pharmaceutically produced oral cannabidiol formulation that is being clinically developed for use in cardiovascular medicine. CardiolRx is currently being evaluated in a Phase II III multi-national randomized double-blind placebo-controlled study the LANCER trial. LANCER is designed to evaluate the efficacy and safety of CardiolRx as a cardioprotective therapy to reduce major cardiovascular and respiratory events in patients hospitalized with COVID 19 who have a prior history of or risk factors for CVD and to investigate the influence CardiolRx has on key biomarkers associated with heart disease. Cardiol has also received IND authorization from the FDA to conduct a Phase II multi national randomized double-blind placebo-controlled trial designed to evaluate the efficacy and safety of CardiolRx in acute myocarditis which remains an important cause of acute and fulminant heart failure in young adults and is a leading cause of sudden cardiac death in people less than 35 years of age. In addition Cardiol is developing a subcutaneous formulation of CardiolRx for the treatment of fibrosis and inflammation in the heart that is associated with the development and progression of heart failure a leading cause of death and hospitalization in the developed world with associated healthcare costs in the U.S. exceeding USD30 billion annually.",
	"website": "https://www.cuc-cayman.com",
	"email": "",
	"phoneNumber": "+1 345 949-5200",
	"fullAddress": "457 North Sound Road,P.O. Box 38, PO Box 38, Grand Cayman, KY",
	"employees": "253",
	"shareOutStanding": 38222985,
	"totalDebtToEquity": 1.25,
	"totalSharesOutStanding": 38160606,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": null,
	"weeks52high": 0.09,
	"weeks52low": 0.005,
	"alpha": null,
	"averageVolume10D": 75769,
	"averageVolume20D": 45820,
	"averageVolume30D": 30547,
	"averageVolume50D": 18328,
	"priceToBook": 1.61,
	"priceToCashFlow": 7.3,
	"returnOnEquity": 12.47,
	"returnOnAssets": 5.16,
	"day21MovingAvg": 0.049286,
	"day50MovingAvg": 0.054375,
	"day200MovingAvg": 0.054375,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "equity",
	"issueType": "XX",
	"close": null,
	"qmdescription": "Regulated Electric Utilities",
	"__typename": "Company"
}