{
	"symbol": "DGS",
	"name": "Dividend Growth Split Corp. Class A Shares",
	"price": 6.95,
	"priceChange": 0.01,
	"percentChange": 0.144092,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Finance",
	"industry": "Asset Management Services",
	"volume": 63107,
	"openPrice": 6.95,
	"dayHigh": 6.95,
	"dayLow": 6.91,
	"MarketCap": 338114769,
	"MarketCapAllClasses": 334411295,
	"peRatio": 13.41,
	"prevClose": 6.94,
	"dividendFrequency": "Monthly",
	"dividendYield": 17.266,
	"dividendAmount": 0.1,
	"dividendCurrency": "CAD",
	"beta": 2.225382,
	"eps": 2.57,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "The Funds investment objectives are to provide holders of Preferred shares with fixed, cumulative, preferential, quarterly cash distributions and to return the original issue price of 10.00 per Preferred share to shareholders at maturity; and to provide holders of Class A shares with regular monthly cash distributions, targeted to be at least 0.10 per Class A share, and the opportunity for growth in Net Asset Value per Class A share. The Fund invests, on an approximately equally weighted basis, in a portfolio consisting primarily of equity securities of Canadian dividend growth companies. In addition, the Fund may hold up to 20% of the total assets of the portfolio in global dividend growth companies for diversification and improved return potential, at the Managers discretion.",
	"fulldescription": "The Funds investment objectives are to provide holders of Preferred shares with fixed, cumulative, preferential, quarterly cash distributions and to return the original issue price of 10.00 per Preferred share to shareholders at maturity; and to provide holders of Class A shares with regular monthly cash distributions, targeted to be at least 0.10 per Class A share, and the opportunity for growth in Net Asset Value per Class A share. The Fund invests, on an approximately equally weighted basis, in a portfolio consisting primarily of equity securities of Canadian dividend growth companies. In addition, the Fund may hold up to 20% of the total assets of the portfolio in global dividend growth companies for diversification and improved return potential, at the Managers discretion. Covered call options and cash¿covered put options may be written from time to time in respect of the equity securities of the issuers included in the portfolio to generate additional distributable income for the Fund and to reduce volatility. Investments will generally be equal weighted at the time of investment and after rebalancing the portfolio, but the Fund may hold non¿equal weight positions.",
	"website": "https://www.bromptongroup.com",
	"email": "",
	"phoneNumber": "+1 416 642-9050",
	"fullAddress": "181 Bay Street, Brookfield Place,Suite 2930, P.O. Box 793, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 48649607,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 48116733,
	"sharesESCROW": null,
	"vwap": 6.93735152,
	"dividendPayDate": "2025-07-15",
	"weeks52high": 7.34,
	"weeks52low": 5.21,
	"alpha": 0.008653,
	"averageVolume10D": 145500,
	"averageVolume20D": 113375,
	"averageVolume30D": 114780,
	"averageVolume50D": 125793,
	"priceToBook": 1.52,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 6.813037,
	"day50MovingAvg": 6.585404,
	"day200MovingAvg": 6.209803,
	"dividend3Years": "",
	"dividend5Years": 0,
	"datatype": "equity",
	"issueType": "CS",
	"close": 6.95,
	"qmdescription": "Asset Management Services",
	"__typename": "Company"
}