{
	"symbol": "DRCU",
	"name": "Desjardins RI Active Canadian Bond - Net-Zero Emissions Pathway ETF",
	"price": 18.72,
	"priceChange": -0.01,
	"percentChange": -0.05339,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 44928000,
	"MarketCapAllClasses": 0,
	"peRatio": 48.26,
	"prevClose": 18.73,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.498,
	"dividendAmount": 0.0554,
	"dividendCurrency": "CAD",
	"beta": 0.257401,
	"eps": null,
	"exDividendDate": "2025-06-23 00:00:00.0",
	"longDescription": "Desjardins RI Active Canadian Bond Low CO2 ETF seeks to achieve a total return comprised of income and long-term capital appreciation by actively investing primarily in debt securities issued by Canadian governments, government agencies and corporations that meet certain ESG criteria determined by the Manager including, at the Managers discretion, debt securities of issuers that reduce the investment carbon intensity levels of the overall portfolio. To achieve fund's objective the Manager will actively manage the portfolio of the Desjardins RI Active Canadian Bond Low CO2 ETF by selecting issuers with a responsible investment approach that meet defined ESG standards so as to create a list of securities that may be invested in. The Manager will select the securities of Canadian corporations, governments of Canada, Canadian provincial or territorial governments and the agencies of such governments or municipalities.",
	"fulldescription": "Desjardins RI Active Canadian Bond Low CO2 ETF seeks to achieve a total return comprised of income and long-term capital appreciation by actively investing primarily in debt securities issued by Canadian governments, government agencies and corporations that meet certain ESG criteria determined by the Manager including, at the Managers discretion, debt securities of issuers that reduce the investment carbon intensity levels of the overall portfolio. To achieve fund's objective the Manager will actively manage the portfolio of the Desjardins RI Active Canadian Bond Low CO2 ETF by selecting issuers with a responsible investment approach that meet defined ESG standards so as to create a list of securities that may be invested in. The Manager will select the securities of Canadian corporations, governments of Canada, Canadian provincial or territorial governments and the agencies of such governments or municipalities. In selecting securities to include in the Desjardins RI Active Canadian Bond Low CO2 ETF the Manager aims to significantly reduce the weighted average carbon intensity level of the Desjardins RI Active Canadian Bond Low CO2 ETF portfolio relative to the applicable market reference index and ensure that all constituent issuers meet predetermined ESG standards.",
	"website": "www.DesjardinsETF.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "1 complexe Desjardins, Suite 2500, P.O. Box 153, Montreal, Québec H5B 1B3., Montreal, QC, CA",
	"employees": "",
	"shareOutStanding": 2400000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 19.22,
	"weeks52low": 17.56416,
	"alpha": -0.002256,
	"averageVolume10D": 676,
	"averageVolume20D": 579,
	"averageVolume30D": 397,
	"averageVolume50D": 289,
	"priceToBook": 2.3,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 18.724127,
	"day50MovingAvg": 18.72379,
	"day200MovingAvg": 18.612162,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 18.77,
	"qmdescription": "",
	"__typename": "Company"
}