{
	"symbol": "DRFE",
	"name": "Desjardins RI Emerging Markets Multifactor - Net-Zero Emissions Pathway ETF",
	"price": 22.98,
	"priceChange": -0.02,
	"percentChange": -0.086957,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1703,
	"openPrice": 23.05,
	"dayHigh": 23.05,
	"dayLow": 22.95,
	"MarketCap": 81579000,
	"MarketCapAllClasses": 0,
	"peRatio": 20.48,
	"prevClose": 23,
	"dividendFrequency": "Quarterly",
	"dividendYield": 6.55,
	"dividendAmount": 0.2231,
	"dividendCurrency": "CAD",
	"beta": 0.3011,
	"eps": null,
	"exDividendDate": "2024-09-20 00:00:00.0",
	"longDescription": "Desjardins RI Emerging Markets Multifactor ¿ Low CO2 ETF seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of an emerging markets index that employs a multifactor approach. To achieve investment objective the investment strategy of the Desjardins RI Emerging Markets Multifactor Low CO2 ETF is to invest, directly or indirectly, in a portfolio of equity securities or other securities selected by the Manager that closely matches the geographic market exposure of the applicable index.",
	"fulldescription": "Desjardins RI Emerging Markets Multifactor ¿ Low CO2 ETF seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of an emerging markets index that employs a multifactor approach. To achieve investment objective the investment strategy of the Desjardins RI Emerging Markets Multifactor Low CO2 ETF is to invest, directly or indirectly, in a portfolio of equity securities or other securities selected by the Manager that closely matches the geographic market exposure of the applicable index. Securities selected for inclusion in the Desjardins RI Emerging Markets Multifactor ¿ Low CO2 ETFs portfolio will have investment characteristics that aggregate six factors: size, valuation, volatility, momentum, profitability and investment, constructed in a manner designed to outperform the cap-weighted Index of the applicable Scientific Beta universe over the long term and control for geographic and sector exposures to mitigate relative country, long-term and sector risk, while taking into account carbon risk exposure by aiming to significantly reduce the weighted average carbon intensity level of the Desjardins RI Emerging Markets Multifactor ¿ Low CO2 ETFs portfolio relative to the applicable cap-weighted Index and ensuring that all constituent issuers meet predetermined ESG standards.",
	"website": "www.DesjardinsETF.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "1 complexe Desjardins, Suite 2500, P.O. Box 153, Montreal, Québec H5B 1B3., Montreal, QC, CA",
	"employees": "",
	"shareOutStanding": 3550000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 23.024375,
	"dividendPayDate": "2024-09-27",
	"weeks52high": 24.27,
	"weeks52low": 18.731933,
	"alpha": 0.00559,
	"averageVolume10D": 1560,
	"averageVolume20D": 1052,
	"averageVolume30D": 865,
	"averageVolume50D": 1075,
	"priceToBook": 2.38,
	"priceToCashFlow": 6.6,
	"returnOnEquity": 15.07,
	"returnOnAssets": 5.72,
	"day21MovingAvg": 23.32762,
	"day50MovingAvg": 23.460297,
	"day200MovingAvg": 22.088966,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 22.98,
	"qmdescription": "",
	"__typename": "Company"
}