{
	"symbol": "DS",
	"name": "Dividend Select 15 Corp. Equity Shares",
	"price": 6.8,
	"priceChange": 0.02,
	"percentChange": 0.294985,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Finance",
	"industry": "Asset Management Services",
	"volume": 14904,
	"openPrice": 6.79,
	"dayHigh": 6.8,
	"dayLow": 6.75,
	"MarketCap": 52402419,
	"MarketCapAllClasses": 57664959,
	"peRatio": 10.68,
	"prevClose": 6.78,
	"dividendFrequency": "Monthly",
	"dividendYield": 9.824,
	"dividendAmount": 0.05567,
	"dividendCurrency": "CAD",
	"beta": 0.767839,
	"eps": 0.58,
	"exDividendDate": "2024-11-29 00:00:00.0",
	"longDescription": "The Companys investment objectives are to provide holders of the Shares of the Company (Shareholders) with (i) monthly cash distributions, plus (ii) the opportunity for capital appreciation, through investment in the common shares of the Portfolio Companies. The Company has been created to provide investors with an opportunity to invest in a portfolio (the Portfolio) of 15 Canadian companies (the Portfolio Companies) whose shares offer investors an above-average dividend yield, and which have shown solid earnings growth and have a history of capital appreciation. The Portfolio Companies will be selected from among 20 companies (the Portfolio Universe) listed on the Toronto Stock Exchange (TSX) set out below: Bank of Montreal Royal Bank of Canada BCE Inc. Shoppers Drug Mart Corporation Canadian Imperial Bank of Sun Life Financial Inc. Commerce TELUS Corporation CI Financial Corp. The Bank of Nova Scotia Enbridge Inc.",
	"fulldescription": "The Companys investment objectives are to provide holders of the Shares of the Company (Shareholders) with (i) monthly cash distributions, plus (ii) the opportunity for capital appreciation, through investment in the common shares of the Portfolio Companies. The Company has been created to provide investors with an opportunity to invest in a portfolio (the Portfolio) of 15 Canadian companies (the Portfolio Companies) whose shares offer investors an above-average dividend yield, and which have shown solid earnings growth and have a history of capital appreciation. The Portfolio Companies will be selected from among 20 companies (the Portfolio Universe) listed on the Toronto Stock Exchange (TSX) set out below: Bank of Montreal Royal Bank of Canada BCE Inc. Shoppers Drug Mart Corporation Canadian Imperial Bank of Sun Life Financial Inc. Commerce TELUS Corporation CI Financial Corp. The Bank of Nova Scotia Enbridge Inc. The Toronto-Dominion Bank EnCana Corporation Thomson Reuters Corporation Great-West Lifeco Inc. TMX Group Inc. Husky Energy Inc. TransAlta Corporation National Bank of Canada TransCanada Corporation Power Corporation of Canada ",
	"website": "https://www.quadravest.com",
	"email": "",
	"phoneNumber": "+1 416 304-4443",
	"fullAddress": "200 Front Street West,Suite 2510, P.O Box 51, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 7706238,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 8480141,
	"sharesESCROW": null,
	"vwap": 6.78773722,
	"dividendPayDate": "2024-12-10",
	"weeks52high": 6.85,
	"weeks52low": 5.65,
	"alpha": 0.002391,
	"averageVolume10D": 12541,
	"averageVolume20D": 10314,
	"averageVolume30D": 10230,
	"averageVolume50D": 9163,
	"priceToBook": 1.13,
	"priceToCashFlow": -18.3,
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 6.695425,
	"day50MovingAvg": 6.596968,
	"day200MovingAvg": 6.056191,
	"dividend3Years": "",
	"dividend5Years": 0,
	"datatype": "equity",
	"issueType": "CS",
	"close": 6.8,
	"qmdescription": "Asset Management Services",
	"__typename": "Company"
}