{
	"symbol": "DXIF",
	"name": "Dynamic Active International ETF",
	"price": 27.27,
	"priceChange": -0.06,
	"percentChange": -0.219539,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 200,
	"openPrice": 27.27,
	"dayHigh": 27.27,
	"dayLow": 27.27,
	"MarketCap": 7499250,
	"MarketCapAllClasses": 0,
	"peRatio": 32.17,
	"prevClose": 27.33,
	"dividendFrequency": "Annual",
	"dividendYield": 1.049,
	"dividendAmount": 0.285,
	"dividendCurrency": "CAD",
	"beta": 0.803219,
	"eps": null,
	"exDividendDate": "2024-12-30 00:00:00.0",
	"longDescription": "DXIF F seeks to provide long-term capital growth by investing primarily in a broadly diversified portfolio of equity securities of businesses located around the world excluding the United States of America and Canada. IIn seeking to achieve its investment objectives, DXIF invests primarily in equity securities of businesses from around the world excluding the United States of America and Canada. The portfolio adviser will generally use a bottom-up value investment approach to select undervalued and yet fundamentally sound companies with strong cash flows and low debt levels or rapidly improving balance sheets. Strategies utilized by the portfolio adviser may include but are not limited to low price to earnings, low price to free cash flow and discounted cash flow analysis. Techniques such as fundamental analysis may be used to assess growth and value potential. This means evaluating the financial condition and management of each company, its industry and the overall economy.",
	"fulldescription": "DXIF F seeks to provide long-term capital growth by investing primarily in a broadly diversified portfolio of equity securities of businesses located around the world excluding the United States of America and Canada. IIn seeking to achieve its investment objectives, DXIF invests primarily in equity securities of businesses from around the world excluding the United States of America and Canada. The portfolio adviser will generally use a bottom-up value investment approach to select undervalued and yet fundamentally sound companies with strong cash flows and low debt levels or rapidly improving balance sheets. Strategies utilized by the portfolio adviser may include but are not limited to low price to earnings, low price to free cash flow and discounted cash flow analysis. Techniques such as fundamental analysis may be used to assess growth and value potential. This means evaluating the financial condition and management of each company, its industry and the overall economy. As part of this evaluation, the portfolio adviser may analyze financial data and other information sources, assess the quality of management, and conduct company interviews, where possible.",
	"website": "http://www.1832.ca",
	"email": "invest@dynamic.ca",
	"phoneNumber": "1-800-268-8186",
	"fullAddress": "Dynamic Funds Tower, 1 Adelaide St. E., 28th Floor, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 275000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 27.27,
	"dividendPayDate": "2025-01-03",
	"weeks52high": 27.81,
	"weeks52low": 21.56,
	"alpha": 0.002323,
	"averageVolume10D": 420,
	"averageVolume20D": 590,
	"averageVolume30D": 702,
	"averageVolume50D": 695,
	"priceToBook": 11.03,
	"priceToCashFlow": 11.4,
	"returnOnEquity": 14.99,
	"returnOnAssets": 7.88,
	"day21MovingAvg": 26.84238,
	"day50MovingAvg": 26.056,
	"day200MovingAvg": 24.947056,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 27.16,
	"qmdescription": "",
	"__typename": "Company"
}