{
	"symbol": "DXR",
	"name": "Dynamic Active Retirement Income ETF",
	"price": 23.23,
	"priceChange": 0.1,
	"percentChange": 0.432339,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 11034250,
	"MarketCapAllClasses": 0,
	"peRatio": 17.4,
	"prevClose": 23.13,
	"dividendFrequency": "Monthly",
	"dividendYield": 5.274,
	"dividendAmount": 0.087,
	"dividendCurrency": "CAD",
	"beta": 0.716806,
	"eps": null,
	"exDividendDate": "2025-06-25 00:00:00.0",
	"longDescription": "DXR seeks to provide total returns that have lower correlations to major stock or bond market indices in the form of income and long-term capital appreciation by investing primarily in dividend-paying or distribution-paying equity securities. DXR will use alternative investment strategies, including the use of leverage, primarily created through the use of borrowing and to a lesser extent through exposure to derivatives and short selling.",
	"fulldescription": "DXR seeks to provide total returns that have lower correlations to major stock or bond market indices in the form of income and long-term capital appreciation by investing primarily in dividend-paying or distribution-paying equity securities. DXR will use alternative investment strategies, including the use of leverage, primarily created through the use of borrowing and to a lesser extent through exposure to derivatives and short selling. The Dynamic ETF will, from time to time and among other investment strategies: invest primarily in securities of issuers that pay, intend to pay, or have paid dividends or distributions that appear attractive based on valuations; invest primarily in issuers located in Canada and the United States although the Dynamic ETF will have the flexibility to invest globally utilizing a free-range approach; invest in securities with no bias towards the issuers market capitalization; short sell highly liquid government bonds with known maturity dates to lock in fixed rate borrowing at an attractive rate, solely for the purpose of leverage; invest in closed-end funds that offer exposure to markets that often sell at sizeable discounts to their net asset values, provided that no more than 10 percentage (at the time of investment) of the net asset value of the Dynamic ETF may be invested in closed-end fund.",
	"website": "http://www.1832.ca",
	"email": "invest@dynamic.ca",
	"phoneNumber": "1-800-268-8186",
	"fullAddress": "Dynamic Funds Tower, 1 Adelaide St. E., 28th Floor, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 475000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 23.35,
	"weeks52low": 20.011481,
	"alpha": 0.001903,
	"averageVolume10D": 323,
	"averageVolume20D": 286,
	"averageVolume30D": 294,
	"averageVolume50D": 330,
	"priceToBook": 1.57,
	"priceToCashFlow": 8.8,
	"returnOnEquity": 14.99,
	"returnOnAssets": 7.88,
	"day21MovingAvg": 22.967043,
	"day50MovingAvg": 22.642014,
	"day200MovingAvg": 22.268053,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 23.17,
	"qmdescription": "",
	"__typename": "Company"
}