{
	"symbol": "EDGF",
	"name": "Brompton European Dividend Growth ETF",
	"price": 11.26,
	"priceChange": -0.01,
	"percentChange": -0.088731,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 4121,
	"openPrice": 11.24,
	"dayHigh": 11.29,
	"dayLow": 11.24,
	"MarketCap": 32091586,
	"MarketCapAllClasses": 0,
	"peRatio": 20.75,
	"prevClose": 11.27,
	"dividendFrequency": "Monthly",
	"dividendYield": 5.585,
	"dividendAmount": 0.0525,
	"dividendCurrency": "CAD",
	"beta": 0.954424,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "The Funds investment objectives are to provide unitholders with stable monthly cash distributions, the opportunity for capital appreciation and lower overall volatility of portfolio returns than would otherwise be experienced by owning securities of European dividend growth companies directly. The Fund seeks to achieve the investment objectives by investing in a portfolio consisting of equity securities of large capitalization European dividend growth companies. To be considered for inclusion, at the time of investment, each European dividend growth company must be domiciled, incorporated and or listed in Europe or, in the Managers view, have significant operating exposure to Europe, have a market capitalization of at least 10 billion dollar, and have a history of dividend growth or, in the Managers view, have potential for future dividend growth. To reduce volatility and to generate distributable income, the Manager may write covered calls.",
	"fulldescription": "The Funds investment objectives are to provide unitholders with stable monthly cash distributions, the opportunity for capital appreciation and lower overall volatility of portfolio returns than would otherwise be experienced by owning securities of European dividend growth companies directly. The Fund seeks to achieve the investment objectives by investing in a portfolio consisting of equity securities of large capitalization European dividend growth companies. To be considered for inclusion, at the time of investment, each European dividend growth company must be domiciled, incorporated and or listed in Europe or, in the Managers view, have significant operating exposure to Europe, have a market capitalization of at least 10 billion dollar, and have a history of dividend growth or, in the Managers view, have potential for future dividend growth. To reduce volatility and to generate distributable income, the Manager may write covered calls. In addition, the Fund will hedge substantially all of its foreign currency exposure back to the Canadian dollar.",
	"website": "https://www.bromptongroup.com/product/european-dividend-growth-fund/",
	"email": "info@bromptongroup.com",
	"phoneNumber": "416-642-6000",
	"fullAddress": "Bay Wellington Tower, Brookfield Place, 181 Bay Street, Suite 2930, P.O. Box 793, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 2850052,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 11.2575609,
	"dividendPayDate": "2025-07-15",
	"weeks52high": 12.14,
	"weeks52low": 9.43,
	"alpha": -0.000624,
	"averageVolume10D": 3047,
	"averageVolume20D": 3200,
	"averageVolume30D": 3999,
	"averageVolume50D": 3885,
	"priceToBook": 2.77,
	"priceToCashFlow": 8.7,
	"returnOnEquity": 27.57,
	"returnOnAssets": 8.63,
	"day21MovingAvg": 11.242456,
	"day50MovingAvg": 11.171721,
	"day200MovingAvg": 10.614944,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "CE",
	"close": 11.28,
	"qmdescription": "",
	"__typename": "Company"
}