{
	"symbol": "ENCC",
	"name": "Global X Canadian Oil and Gas Equity Covered Call ETF",
	"price": 11.74,
	"priceChange": 0,
	"percentChange": 0,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 65442,
	"openPrice": 11.79,
	"dayHigh": 11.79,
	"dayLow": 11.67,
	"MarketCap": 478197989,
	"MarketCapAllClasses": 0,
	"peRatio": 7.86,
	"prevClose": 11.74,
	"dividendFrequency": "Monthly",
	"dividendYield": 13.288,
	"dividendAmount": 0.13,
	"dividendCurrency": "CAD",
	"beta": 1.749646,
	"eps": null,
	"exDividendDate": "2024-10-31 00:00:00.0",
	"longDescription": "To achieve its investment objective, ENCC invests in an equal weighted portfolio of Canadian companies in accordance with their respective investment objectives, which may include ETFs that provide exposure to such companies. Semiannually, on the Constituent Reset Date, the Investment Manager will, based on the applicable reference index for ENCC, identify the largest and most liquid Canadian issuers listed on the TSX in its sectors and will invest ENCCs portfolios in each issuer. ENCC will rebalance, on an equal weight basis, the portfolio of constituent securities on each Constituent Reset Date. To achieve its investment objective, each of ENCC invests in an equal weighted portfolio of Canadian companies in accordance with their respective investment objectives, which may include ETFs that provide exposure to such companies.",
	"fulldescription": "To achieve its investment objective, ENCC invests in an equal weighted portfolio of Canadian companies in accordance with their respective investment objectives, which may include ETFs that provide exposure to such companies. Semiannually, on the Constituent Reset Date, the Investment Manager will, based on the applicable reference index for ENCC, identify the largest and most liquid Canadian issuers listed on the TSX in its sectors and will invest ENCCs portfolios in each issuer. ENCC will rebalance, on an equal weight basis, the portfolio of constituent securities on each Constituent Reset Date. To achieve its investment objective, each of ENCC invests in an equal weighted portfolio of Canadian companies in accordance with their respective investment objectives, which may include ETFs that provide exposure to such companies. Semiannually, on the Constituent Reset Date, the Investment Manager will, based on the applicable reference index for ENCC, identify the largest and most liquid Canadian issuers listed on the TSX in their respective sectors and will invest ENCC portfolios accordingly in each issuer equally.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 40732367,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 11.7423565,
	"dividendPayDate": "2024-11-07",
	"weeks52high": 11.8,
	"weeks52low": 10.14,
	"alpha": 0.010824,
	"averageVolume10D": 92420,
	"averageVolume20D": 135970,
	"averageVolume30D": 130750,
	"averageVolume50D": 138739,
	"priceToBook": 1.19,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 11.276124,
	"day50MovingAvg": 11.102639,
	"day200MovingAvg": 10.648132,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 11.74,
	"qmdescription": "",
	"__typename": "Company"
}