{
	"symbol": "FAUS",
	"name": "Fidelity Advanced U.S. Equity Fund",
	"price": 23.67,
	"priceChange": -0.43,
	"percentChange": -1.784232,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 2367000,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 24.1,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": 2.228824,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "To meet the Funds objectives, Uses quantitative techniques and the investment insights generated by fundamental research to systematically construct the Funds portfolio. Uses a quantitative model applied universally to score each security in the investable universe. Each stock receives a final score based on the combined evaluation of the following factors Fundamental research - Incorporates signals from proprietary data generated by fundamental research analysts, which considers various factors including financial condition, industry position, economic and market conditions, earnings estimates, operational performance, quality of management, and internal research forecasts. External Research - In addition to fundamental and quantitative inputs, the portfolio management team may analyze external market data which can include sentiment changes, external analyst models, option volumes, short interest, fund flows, upcoming catalysts, corporate actions, and management meetings.",
	"fulldescription": "To meet the Funds objectives, Uses quantitative techniques and the investment insights generated by fundamental research to systematically construct the Funds portfolio. Uses a quantitative model applied universally to score each security in the investable universe. Each stock receives a final score based on the combined evaluation of the following factors Fundamental research - Incorporates signals from proprietary data generated by fundamental research analysts, which considers various factors including financial condition, industry position, economic and market conditions, earnings estimates, operational performance, quality of management, and internal research forecasts. External Research - In addition to fundamental and quantitative inputs, the portfolio management team may analyze external market data which can include sentiment changes, external analyst models, option volumes, short interest, fund flows, upcoming catalysts, corporate actions, and management meetings. Seeks to manage risk by constructing a broadly diversified portfolio. May incorporate a range of data sources in the research process, including non-traditional or alternative data sources. In certain circumstances and based on factors such as liquidity and market volatility, may override the quantitative models results in the selection of portfolio securities The Fund aims to achieve longterm capital growth.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 100000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": null,
	"weeks52high": 25.08,
	"weeks52low": 19.58,
	"alpha": -0.028446,
	"averageVolume10D": 120,
	"averageVolume20D": 150,
	"averageVolume30D": 160,
	"averageVolume50D": 102,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 23.402382,
	"day50MovingAvg": 22.6788,
	"day200MovingAvg": 22.754183,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 24,
	"qmdescription": "",
	"__typename": "Company"
}