{
	"symbol": "FHI",
	"name": "CI Health Care Giants Covered Call ETF",
	"price": 10.31,
	"priceChange": -0.03,
	"percentChange": -0.290135,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 2553,
	"openPrice": 10.29,
	"dayHigh": 10.35,
	"dayLow": 10.29,
	"MarketCap": 105162000,
	"MarketCapAllClasses": 0,
	"peRatio": 25.55,
	"prevClose": 10.34,
	"dividendFrequency": "Quarterly",
	"dividendYield": 8.039,
	"dividendAmount": 0.2127,
	"dividendCurrency": "CAD",
	"beta": 0.664556,
	"eps": null,
	"exDividendDate": "2025-06-24 00:00:00.0",
	"longDescription": "The First Asset ETFs investment objectives are to provide holders, through an actively managed portfolio, with (i) regular cash distributions, (ii) the opportunity for capital appreciation by investing on an equal weight basis in a portfolio of securities of the 20 health care companies, as determined by the Manager in its discretion, with the largest market capitalization listed on a North American stock exchange, and (iii) lower overall volatility of returns on the portfolio than would be experienced by owning a portfolio of securities of such issuers directly, by employing a covered call option writing program.",
	"fulldescription": "The First Asset ETFs investment objectives are to provide holders, through an actively managed portfolio, with (i) regular cash distributions, (ii) the opportunity for capital appreciation by investing on an equal weight basis in a portfolio of securities of the 20 health care companies, as determined by the Manager in its discretion, with the largest market capitalization listed on a North American stock exchange, and (iii) lower overall volatility of returns on the portfolio than would be experienced by owning a portfolio of securities of such issuers directly, by employing a covered call option writing program. The First Asset ETFs investment objectives are to provide holders, through an actively managed portfolio, with (i) regular cash distributions, (ii) the opportunity for capital appreciation by investing on an equal weight basis in a portfolio of securities of the 20 health care companies, as determined by the Manager in its discretion, with the largest market capitalization listed on a North American stock exchange, and (iii) lower overall volatility of returns on the portfolio than would be experienced by owning a portfolio of securities of such issuers directly, by employing a covered call option writing program.",
	"website": "www.firstasset.com",
	"email": "",
	"phoneNumber": "+1 416 3622929",
	"fullAddress": "95 Wellington St. West,, Suite 1400, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 10200000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 10.346,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 12.29,
	"weeks52low": 9.91,
	"alpha": 0.002371,
	"averageVolume10D": 9507,
	"averageVolume20D": 10240,
	"averageVolume30D": 9215,
	"averageVolume50D": 7342,
	"priceToBook": 4.47,
	"priceToCashFlow": 14.3,
	"returnOnEquity": 28.42,
	"returnOnAssets": 8.49,
	"day21MovingAvg": 10.235159,
	"day50MovingAvg": 10.170914,
	"day200MovingAvg": 10.550142,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 10.32,
	"qmdescription": "",
	"__typename": "Company"
}