{
	"symbol": "FLSD",
	"name": "Franklin Canadian Short Term Bond Fund",
	"price": 19.24,
	"priceChange": -0.03,
	"percentChange": -0.155682,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 600,
	"openPrice": 19.27,
	"dayHigh": 19.27,
	"dayLow": 19.24,
	"MarketCap": 44252000,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 19.27,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.482,
	"dividendAmount": 0.070556,
	"dividendCurrency": "CAD",
	"beta": 0.105256,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "By investing substantially all of its assets in securities of Franklin Bissett Short Duration Bond Fund (or its successor fund). In pursuing its investment objective, the underlying fund will generally have a duration of 3.5 years or lower and may invest up to 40% of its assets in debt securities that are rated below investment grade, sometimes called high yield securities; may invest up to 30% of its assets in foreign securities including those of both developed and emerging markets; and may invest in loans and loan participations, sometimes called corporate or syndicated loans, made to corporate and other business entities by banks and other financial institutions.",
	"fulldescription": "By investing substantially all of its assets in securities of Franklin Bissett Short Duration Bond Fund (or its successor fund). In pursuing its investment objective, the underlying fund will generally have a duration of 3.5 years or lower and may invest up to 40% of its assets in debt securities that are rated below investment grade, sometimes called high yield securities; may invest up to 30% of its assets in foreign securities including those of both developed and emerging markets; and may invest in loans and loan participations, sometimes called corporate or syndicated loans, made to corporate and other business entities by banks and other financial institutions. Franklin Liberty Short Duration Bond ETF (the Fund) seeks to provide high income and preservation of capital through exposure to Canadian fixed income securities, including federal and provincial government and corporate bonds, debentures and short term notes, by investing substantially all of its assets in securities of Franklin Bissett Short Duration Bond Fund (or its successor fund).",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 2300000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 19.2583333,
	"dividendPayDate": "2025-07-09",
	"weeks52high": 19.53,
	"weeks52low": 18.146571,
	"alpha": 0.001121,
	"averageVolume10D": 1864,
	"averageVolume20D": 1356,
	"averageVolume30D": 11541,
	"averageVolume50D": 7803,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 19.239725,
	"day50MovingAvg": 19.210905,
	"day200MovingAvg": 19.013933,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 19.27,
	"qmdescription": "",
	"__typename": "Company"
}