{
	"symbol": "FOOD.DB.A",
	"name": "Goodfood Market Corp. 5.75% convertible unsecured subordinated debentures",
	"price": 33,
	"priceChange": 1.87,
	"percentChange": 6.007067,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Consumer Discretionary",
	"industry": "Personal Services",
	"volume": 2000,
	"openPrice": 33,
	"dayHigh": 33,
	"dayLow": 33,
	"MarketCap": 9585180,
	"MarketCapAllClasses": 3239880237,
	"peRatio": "",
	"prevClose": 31.13,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": -0.256447,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "At Goodfood we make good things happen. Everyday we empower our team members to think big build something innovative and witness the impact of their contribution. Join the team that has fun making the impossible come true everyday! Were a group of passionate and proud Goodfoodies on a mission to revolutionize the future of food with our innovative and dynamic culture. What you do here matters and when you grow with us your career journey has endless possibilities! We are Canadas largest independent online grocery company which became a billion dollar brand in 2021. Jonathan Ferrari and Neil Cuggy co-founded Goodfood in Montreal in 2014 with the goal of changing the way Canadians cook. Goodfood members get access to a unique selection of products online as well as exclusive pricing made possible by its world class direct to consumer fulfilment ecosystem that cuts out food waste and expensive retail overhead.",
	"fulldescription": "At Goodfood we make good things happen. Everyday we empower our team members to think big build something innovative and witness the impact of their contribution. Join the team that has fun making the impossible come true everyday! Were a group of passionate and proud Goodfoodies on a mission to revolutionize the future of food with our innovative and dynamic culture. What you do here matters and when you grow with us your career journey has endless possibilities! We are Canadas largest independent online grocery company which became a billion dollar brand in 2021. Jonathan Ferrari and Neil Cuggy co-founded Goodfood in Montreal in 2014 with the goal of changing the way Canadians cook. Goodfood members get access to a unique selection of products online as well as exclusive pricing made possible by its world class direct to consumer fulfilment ecosystem that cuts out food waste and expensive retail overhead. Today Goodfood is a team of over 1500 passionate individuals planning preparing and delivering delicious meals daily across Canada including locations in Toronto Montreal Vancouver & Calgary. Goodfood delivers to more than 300000 happy households from coast to coast. The Company has been publicly traded on the Toronto Stock Exchange since June 2017 TSX:FOOD.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "4600 HICKMORE, SAINT-LAURENT, QC, H4T 1K2 CA,SAINT-LAURENT QC H4T 1K2 CA, CA",
	"employees": "570",
	"shareOutStanding": 290460,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 98178189,
	"sharesESCROW": null,
	"vwap": 33,
	"dividendPayDate": null,
	"weeks52high": 50,
	"weeks52low": 31.03,
	"alpha": -0.011324,
	"averageVolume10D": 200,
	"averageVolume20D": 850,
	"averageVolume30D": 25867,
	"averageVolume50D": 17380,
	"priceToBook": -0.48,
	"priceToCashFlow": -3.1,
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 31.214287,
	"day50MovingAvg": 31.8274,
	"day200MovingAvg": 39.34235,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "equity",
	"issueType": "DB",
	"close": 33,
	"qmdescription": "Personal Services",
	"__typename": "Company"
}