{
	"symbol": "FSB",
	"name": "CI Enhanced Short Duration Bond Fund",
	"price": 9.66,
	"priceChange": 0,
	"percentChange": 0,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1596,
	"openPrice": 9.67,
	"dayHigh": 9.67,
	"dayLow": 9.66,
	"MarketCap": 187624287,
	"MarketCapAllClasses": 0,
	"peRatio": 20.7,
	"prevClose": 9.66,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.975,
	"dividendAmount": 0.032,
	"dividendCurrency": "CAD",
	"beta": 0.093982,
	"eps": null,
	"exDividendDate": "2024-11-25 00:00:00.0",
	"longDescription": "The First Asset ETFs investment objective is to provide absolute returns through interest income and capital gains and its risk objective is to have very low volatility and positive returns over any twelve month period. The First Asset ETFs investment objective is to provide absolute returns through interest income and capital gains and its risk objective is to have very low volatility and positive returns over any twelve month period. The First Asset ETF will primarily invest in debt instruments across the credit spectrum including cash, government debt, investment grade corporate debt, high yield corporate debt, government debt futures, convertible debentures and credit derivatives. The First Asset ETFs strategy will primarily focus on US and Canadian corporate bonds and will include the use of government bond futures to manage the duration of the fund according to the volatility objectives.",
	"fulldescription": "The First Asset ETFs investment objective is to provide absolute returns through interest income and capital gains and its risk objective is to have very low volatility and positive returns over any twelve month period. The First Asset ETFs investment objective is to provide absolute returns through interest income and capital gains and its risk objective is to have very low volatility and positive returns over any twelve month period. The First Asset ETF will primarily invest in debt instruments across the credit spectrum including cash, government debt, investment grade corporate debt, high yield corporate debt, government debt futures, convertible debentures and credit derivatives. The First Asset ETFs strategy will primarily focus on US and Canadian corporate bonds and will include the use of government bond futures to manage the duration of the fund according to the volatility objectives. To minimize interest rate volatility, the First Asset ETF would typically target an overall portfolio duration of less than 2 years.",
	"website": "www.ci.com",
	"email": "service@cifunds.com",
	"phoneNumber": "+1 416 3641145",
	"fullAddress": "15 York Street, 2nd Floor, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 19422804,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 9.66066666,
	"dividendPayDate": "2024-11-29",
	"weeks52high": 9.75,
	"weeks52low": 9.276011,
	"alpha": 0.001305,
	"averageVolume10D": 6048,
	"averageVolume20D": 6842,
	"averageVolume30D": 6599,
	"averageVolume50D": 5286,
	"priceToBook": 3.42,
	"priceToCashFlow": 13.9,
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 9.663333,
	"day50MovingAvg": 9.657615,
	"day200MovingAvg": 9.484364,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 9.66,
	"qmdescription": "",
	"__typename": "Company"
}