{
	"symbol": "GCBD",
	"name": "Guardian Canadian Bond Fund",
	"price": 18.14,
	"priceChange": 0.04,
	"percentChange": 0.220994,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 615,
	"openPrice": 18.14,
	"dayHigh": 18.15,
	"dayLow": 18.14,
	"MarketCap": 77899890,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 18.1,
	"dividendFrequency": "Quarterly",
	"dividendYield": 2.487,
	"dividendAmount": 0.1245,
	"dividendCurrency": "CAD",
	"beta": 0.350326,
	"eps": null,
	"exDividendDate": "2024-09-23 00:00:00.0",
	"longDescription": "Guardian Canadian Bond ETF (the Fund) seeks to provide a high level of current interest income while at the same time preserving capital and seeking opportunities for capital appreciation by investing, directly or indirectly, primarily in Canadian bonds, debentures, notes or other evidence of indebtedness. In order to achieve its investment objectives, the Guardian Canadian Bond ETF invests, directly or indirectly, primarily in Canadian bonds, debentures, notes or other evidence of indebtedness. The Manager uses a pro-active, disciplined management approach while employing various analytical tools to identify investments that offer value on a relative basis with a view to maximizing current income while preserving the prospect for some capital growth. The Manager adheres to a risk management process that is designed to limit total exposure to individual issuers, diversify exposure to various term maturities and credit risks, and maintain portfolio liquidity.",
	"fulldescription": "Guardian Canadian Bond ETF (the Fund) seeks to provide a high level of current interest income while at the same time preserving capital and seeking opportunities for capital appreciation by investing, directly or indirectly, primarily in Canadian bonds, debentures, notes or other evidence of indebtedness. In order to achieve its investment objectives, the Guardian Canadian Bond ETF invests, directly or indirectly, primarily in Canadian bonds, debentures, notes or other evidence of indebtedness. The Manager uses a pro-active, disciplined management approach while employing various analytical tools to identify investments that offer value on a relative basis with a view to maximizing current income while preserving the prospect for some capital growth. The Manager adheres to a risk management process that is designed to limit total exposure to individual issuers, diversify exposure to various term maturities and credit risks, and maintain portfolio liquidity. The Guardian Canadian Bond ETF may be invested in foreign-pay Canadian issues and securities of foreign issuers. Under normal market conditions, a maximum of 30% of the Guardian Canadian Bond ETF may be held in foreign denominated securities.",
	"website": "https://www.guardiancapital.com/",
	"email": "",
	"phoneNumber": "M5L 1E8",
	"fullAddress": "Commerce Court West, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 4294371,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 18.1466666,
	"dividendPayDate": "2024-09-27",
	"weeks52high": 18.71,
	"weeks52low": 17.179566,
	"alpha": -0.00204,
	"averageVolume10D": 620,
	"averageVolume20D": 1689,
	"averageVolume30D": 1921,
	"averageVolume50D": 2560,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 18.311905,
	"day50MovingAvg": 18.367449,
	"day200MovingAvg": 17.83715,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 18.14,
	"qmdescription": "",
	"__typename": "Company"
}