{
	"symbol": "HAB",
	"name": "Global X Active Corporate Bond ETF",
	"price": 10.13,
	"priceChange": 0.02,
	"percentChange": 0.197824,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 3731,
	"openPrice": 10.08,
	"dayHigh": 10.13,
	"dayLow": 10.08,
	"MarketCap": 347121753,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 10.11,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.791,
	"dividendAmount": 0.0325,
	"dividendCurrency": "CAD",
	"beta": 0.294901,
	"eps": null,
	"exDividendDate": "2024-10-31 00:00:00.0",
	"longDescription": "In order to achieve investment objective HAB invests primarily in a portfolio of debt including debt-like securities of Canadian and U.S. companies, directly, or indirectly through investments in securities of other investment funds, including Listed Funds, as they are defined in the ETFs prospectus. The Sub-Advisor, Fiera Capital Corporation Fiera or the Sub-Advisor, uses fundamental credit research to select the securities of companies that based on the Sub-Advisors view on the companys industry and growth prospects are believed to offer superior risk adjusted returns relative to passively managed corporate bond indexes. When the Sub Advisor believes that interest rates will increase the Sub-Advisor may choose securities with shorter terms and when the Sub-Advisor believes that interest rates will decrease, the Sub-Advisor may choose securities with longer terms.",
	"fulldescription": "In order to achieve investment objective HAB invests primarily in a portfolio of debt including debt-like securities of Canadian and U.S. companies, directly, or indirectly through investments in securities of other investment funds, including Listed Funds, as they are defined in the ETFs prospectus. The Sub-Advisor, Fiera Capital Corporation Fiera or the Sub-Advisor, uses fundamental credit research to select the securities of companies that based on the Sub-Advisors view on the companys industry and growth prospects are believed to offer superior risk adjusted returns relative to passively managed corporate bond indexes. When the Sub Advisor believes that interest rates will increase the Sub-Advisor may choose securities with shorter terms and when the Sub-Advisor believes that interest rates will decrease, the Sub-Advisor may choose securities with longer terms. The Sub-Advisor seeks diversification by industry sector and geographic region and relies on its in-depth fundamental credit research, view of market trends, analysis of the companys competitive position, and review of the return relative to the companys risk and general market conditions, to select securities for the ETF. The investment objective of HAB is to seek longterm capital growth and generate high income.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 34266708,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 10.0921621,
	"dividendPayDate": "2024-11-07",
	"weeks52high": 10.29,
	"weeks52low": 9.52,
	"alpha": -0.000413,
	"averageVolume10D": 6341,
	"averageVolume20D": 6795,
	"averageVolume30D": 7819,
	"averageVolume50D": 9481,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 10.165232,
	"day50MovingAvg": 10.164347,
	"day200MovingAvg": 9.844447,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 10.13,
	"qmdescription": "",
	"__typename": "Company"
}