{
	"symbol": "HBD",
	"name": "BetaPro Gold Bullion -2x Daily Bear ETF",
	"price": 6.24,
	"priceChange": -0.17,
	"percentChange": -2.652106,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 4145,
	"openPrice": 6.34,
	"dayHigh": 6.34,
	"dayLow": 6.24,
	"MarketCap": 1727700,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 6.41,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": -0.334768,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "HBD seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times 200 Percentage the inverse opposite of the daily performance of the Solactive Gold Front Month MD Rolling Futures Index ER the Underlying Index, Bloomberg ticker SOLCGCER. HBD is denominated in Canadian dollars. Any US dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of its ability. The Fund If HBD is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as its Underlying Index declines on that given day. Conversely, HBDs net asset value should lose approximately two times as much on a given day, on a percentage basis, as its Underlying Index rises on that given day.",
	"fulldescription": "HBD seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times 200 Percentage the inverse opposite of the daily performance of the Solactive Gold Front Month MD Rolling Futures Index ER the Underlying Index, Bloomberg ticker SOLCGCER. HBD is denominated in Canadian dollars. Any US dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of its ability. The Fund If HBD is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as its Underlying Index declines on that given day. Conversely, HBDs net asset value should lose approximately two times as much on a given day, on a percentage basis, as its Underlying Index rises on that given day. HBD takes positions in financial instruments that, in combination, should have similar daily return characteristics to two times 200 Percentage the inverse opposite of the daily performance of its Underlying Index, which tracks a rolling position in the gold futures contract traded on the Chicago Mercantile Exchange the Referenced Futures Contract for a subsequent delivery month. In order to achieve this objective, the total underlying notional value of these instruments will typically 8 Management Discussion of Fund Performance continued not exceed two times the total assets of the ETF. As such, HBD employs absolute leverage. Assets not invested in financial instruments may be invested in debt instruments or money market instruments with a term not to exceed 365 days, or reverse repurchase agreements with a term not to exceed 30 days.",
	"website": "www.HorizonsETFs.com",
	"email": "",
	"phoneNumber": "416 933 5745",
	"fullAddress": "26 Wellington St E., Suite 920, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 276875,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 6.28625,
	"dividendPayDate": null,
	"weeks52high": 11,
	"weeks52low": 5.89,
	"alpha": -0.014826,
	"averageVolume10D": 4137,
	"averageVolume20D": 5751,
	"averageVolume30D": 9113,
	"averageVolume50D": 10028,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 6.383333,
	"day50MovingAvg": 6.4438,
	"day200MovingAvg": 7.8741,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 6.24,
	"qmdescription": "",
	"__typename": "Company"
}