{
	"symbol": "HBLK",
	"name": "Blockchain Technologies ETF",
	"price": 20.26,
	"priceChange": -0.33,
	"percentChange": -1.60272,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 2725,
	"openPrice": 20.29,
	"dayHigh": 20.29,
	"dayLow": 20.26,
	"MarketCap": 24717201,
	"MarketCapAllClasses": 0,
	"peRatio": 17.03,
	"prevClose": 20.59,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": 2.637877,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "The Fund seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of the Harvest Blockchain Technologies Index the Index. The Fund invests in equity securities of issuers exposed, directly or indirectly, to the development and implementation of blockchain and distributed ledger technologies. The Fund In order to achieve its investment objective and to obtain direct or indirect exposure to the Constituent Securities 1 of the Index, the Fund may hold the Constituent Securities of the Index in approximately the same proportion as they are reflected in that Index or may hold securities of one or more exchange traded funds that replicate the performance of the applicable Index, or a subset of such Index. The Fund will invest in its own portfolio comprised of various securities and instruments which may include, but are not limited to, equity and equity related securities.",
	"fulldescription": "The Fund seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of the Harvest Blockchain Technologies Index the Index. The Fund invests in equity securities of issuers exposed, directly or indirectly, to the development and implementation of blockchain and distributed ledger technologies. The Fund In order to achieve its investment objective and to obtain direct or indirect exposure to the Constituent Securities 1 of the Index, the Fund may hold the Constituent Securities of the Index in approximately the same proportion as they are reflected in that Index or may hold securities of one or more exchange traded funds that replicate the performance of the applicable Index, or a subset of such Index. The Fund will invest in its own portfolio comprised of various securities and instruments which may include, but are not limited to, equity and equity related securities. Equity related securities held by the Fund may include, but are not limited to, convertible debt, income trust units, single issuer equity options, preferred shares and warrants. If market conditions require, in order to preserve capital, the Fund may seek to invest a substantial portion of its assets in cash and cash equivalents.",
	"website": "www.harvestportfolios.com",
	"email": "info@harvestportfolios.com",
	"phoneNumber": "416 649 4541",
	"fullAddress": "610 Chartwell Rd, Suite 204, Oakville, ON L6J 4A5, Oakville, ON, CA",
	"employees": "",
	"shareOutStanding": 1220000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 20.2677777,
	"dividendPayDate": null,
	"weeks52high": 22.54,
	"weeks52low": 12.01,
	"alpha": 0.000908,
	"averageVolume10D": 2552,
	"averageVolume20D": 1998,
	"averageVolume30D": 2367,
	"averageVolume50D": 2702,
	"priceToBook": 1.93,
	"priceToCashFlow": 9.4,
	"returnOnEquity": -1.36,
	"returnOnAssets": -6.92,
	"day21MovingAvg": 17.901905,
	"day50MovingAvg": 16.7972,
	"day200MovingAvg": 17.46835,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 20.27,
	"qmdescription": "",
	"__typename": "Company"
}