{
	"symbol": "HBU",
	"name": "BetaPro Gold Bullion 2x Daily Bull ETF",
	"price": 18.04,
	"priceChange": 0.44,
	"percentChange": 2.5,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 39833,
	"openPrice": 17.82,
	"dayHigh": 18.11,
	"dayLow": 17.82,
	"MarketCap": 19755785,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 17.6,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": 0.451864,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "HBU seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times (200%) the daily performance of the Solactive Gold Front Month MD Rolling Futures Index ER (the Underlying Index, Bloomberg ticker: SOLCGCER). HBU is denominated in Canadian dollars. Any U.S. dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of its ability. If HBU is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as its Underlying Index rises on that given day. Conversely, HBUs net asset value should lose approximately two times as much on a given day, on a percentage basis, as its Underlying Index declines on that given day.",
	"fulldescription": "HBU seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times (200%) the daily performance of the Solactive Gold Front Month MD Rolling Futures Index ER (the Underlying Index, Bloomberg ticker: SOLCGCER). HBU is denominated in Canadian dollars. Any U.S. dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of its ability. If HBU is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as its Underlying Index rises on that given day. Conversely, HBUs net asset value should lose approximately two times as much on a given day, on a percentage basis, as its Underlying Index declines on that given day. HBU takes positions in financial instruments that, in combination, should have similar daily return characteristics to two times (200%) the daily performance of its Underlying Index, which tracks a rolling position in the gold futures contract traded on the Chicago Mercantile Exchange (the Referenced Futures Contract) for a subsequent delivery month. The Fund HBU seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times 200 Percentage the daily performance of the Solactive Gold Front Month MD Rolling Futures Index ER the Underlying Index, Bloomberg ticker SOLCGCER. HBU is denominated in Canadian dollars. Any US dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of its ability.",
	"website": "www.HorizonsETFs.com",
	"email": "",
	"phoneNumber": "416 933 5745",
	"fullAddress": "26 Wellington St E., Suite 920, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 1095110,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 18.0011704,
	"dividendPayDate": null,
	"weeks52high": 19.38,
	"weeks52low": 10.82,
	"alpha": 0.01048,
	"averageVolume10D": 32782,
	"averageVolume20D": 27843,
	"averageVolume30D": 23571,
	"averageVolume50D": 19381,
	"priceToBook": null,
	"priceToCashFlow": 5.3,
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 17.80857,
	"day50MovingAvg": 17.7022,
	"day200MovingAvg": 15.06455,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 18.04,
	"qmdescription": "",
	"__typename": "Company"
}