{
	"symbol": "HBUG",
	"name": "Global X Cybersecurity Index ETF",
	"price": 25.32,
	"priceChange": -0.72,
	"percentChange": -2.764977,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 2709240,
	"MarketCapAllClasses": 0,
	"peRatio": 30.73,
	"prevClose": 26.04,
	"dividendFrequency": "Annual",
	"dividendYield": 1.326,
	"dividendAmount": 0.34694,
	"dividendCurrency": "CAD",
	"beta": 0.627865,
	"eps": null,
	"exDividendDate": "2023-12-28 00:00:00.0",
	"longDescription": "To achieve its investment objective, HBUG generally invests and holds, directly or indirectly, equity securities of the Constituent Issuers in substantially the same proportion as its Underlying Index. HBUG may also invest in ADRs or GDRs representing equity securities of Constituent Issuers of its Underlying Index. To the extent permitted, HBUG will generally be fully invested in or exposed to its Underlying Index at all times. HBUG seeks to replicate, to the extent possible and net of expenses, the performance of an index that is designed to provide exposure to the performance of global, publicly listed companies that stand to potentially benefit from the increased adoption of cybersecurity technology, such as those whose principal business is generally engaged in the development and management of security protocols preventing intrusion and attacks to systems, networks, applications, computers, and mobile devices.",
	"fulldescription": "To achieve its investment objective, HBUG generally invests and holds, directly or indirectly, equity securities of the Constituent Issuers in substantially the same proportion as its Underlying Index. HBUG may also invest in ADRs or GDRs representing equity securities of Constituent Issuers of its Underlying Index. To the extent permitted, HBUG will generally be fully invested in or exposed to its Underlying Index at all times. HBUG seeks to replicate, to the extent possible and net of expenses, the performance of an index that is designed to provide exposure to the performance of global, publicly listed companies that stand to potentially benefit from the increased adoption of cybersecurity technology, such as those whose principal business is generally engaged in the development and management of security protocols preventing intrusion and attacks to systems, networks, applications, computers, and mobile devices. Currently, HBUG seeks to replicate, directly or indirectly, the performance of Indxx Cybersecurity Index, net of expenses, by investing primarily in the Global X Cybersecurity ETF. HBUG seeks to hedge any U.S. dollar portfolio exposure back to the Canadian dollar at all times.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 107000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2024-01-08",
	"weeks52high": 26.2,
	"weeks52low": 20.4863,
	"alpha": -0.002875,
	"averageVolume10D": 93,
	"averageVolume20D": 87,
	"averageVolume30D": 113,
	"averageVolume50D": 177,
	"priceToBook": 6.47,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 25.098095,
	"day50MovingAvg": 24.5592,
	"day200MovingAvg": 23.46125,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 26.16,
	"qmdescription": "",
	"__typename": "Company"
}