{
	"symbol": "HDGE.U",
	"name": "Accelerate Absolute Return Fund",
	"price": 19.25,
	"priceChange": 0.03,
	"percentChange": 0.156087,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 100,
	"openPrice": 19.25,
	"dayHigh": 19.25,
	"dayLow": 19.25,
	"MarketCap": 28875000,
	"MarketCapAllClasses": 0,
	"peRatio": 3.5,
	"prevClose": 19.22,
	"dividendFrequency": "Quarterly",
	"dividendYield": 2.082,
	"dividendAmount": 0.1,
	"dividendCurrency": "CAD",
	"beta": 0.65871,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "The investment objective of the Accelerate Absolute Return Hedge Fund the Fund or HDGE is to seeks to achieve long term capital appreciation and a superior risk-adjusted return relative to the broader Canadian equity market... To achieve fund's objective the Fund HDGE seeks to outperform the Canadian equity market over the long term with lower volatility by investing primarily in listed equity securities that are expected to outperform this market, while selling short certain listed equity securities that are expected to underperform this market. The aggregate market value of the securities sold short will not exceed the limits permitted under applicable securities legislation.",
	"fulldescription": "The investment objective of the Accelerate Absolute Return Hedge Fund the Fund or HDGE is to seeks to achieve long term capital appreciation and a superior risk-adjusted return relative to the broader Canadian equity market... To achieve fund's objective the Fund HDGE seeks to outperform the Canadian equity market over the long term with lower volatility by investing primarily in listed equity securities that are expected to outperform this market, while selling short certain listed equity securities that are expected to underperform this market. The aggregate market value of the securities sold short will not exceed the limits permitted under applicable securities legislation. In order to achieve its investment objective, HDGE engages in a systematic, long short equity investment strategy by investing primarily in long and short positions of equity securities that are listed on an exchange or marketplace in Canada or the US Security selection of the long and short portfolios is driven by an integrated multi-factor approach, consistent with empirical data and financial theory, based on factors that include value, quality, price momentum, operational momentum and trend. The Portfolio Manager applies its propr",
	"website": "www.AccelerateShares.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "Suite 300, 524 17 Avenue SW, Calgary, Alberta, T2S 0B2, CA",
	"employees": "",
	"shareOutStanding": 1500000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 19.25,
	"dividendPayDate": "2025-07-08",
	"weeks52high": 20.455983,
	"weeks52low": 17.416405,
	"alpha": -0.005613,
	"averageVolume10D": 70,
	"averageVolume20D": 90,
	"averageVolume30D": 80,
	"averageVolume50D": 68,
	"priceToBook": 2.22,
	"priceToCashFlow": 5.5,
	"returnOnEquity": 31.11,
	"returnOnAssets": 12.49,
	"day21MovingAvg": 19.337847,
	"day50MovingAvg": 19.110786,
	"day200MovingAvg": 18.984287,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "CE",
	"close": 19.21,
	"qmdescription": "",
	"__typename": "Company"
}