{
	"symbol": "HEB",
	"name": "Hamilton Canadian Bank Equal-Weight Index ETF",
	"price": 19.92,
	"priceChange": 0.06,
	"percentChange": 0.302115,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1105,
	"openPrice": 19.9,
	"dayHigh": 19.92,
	"dayLow": 19.9,
	"MarketCap": 788610530,
	"MarketCapAllClasses": 0,
	"peRatio": 12.66,
	"prevClose": 19.86,
	"dividendFrequency": "Monthly",
	"dividendYield": 4.157,
	"dividendAmount": 0.069,
	"dividendCurrency": "CAD",
	"beta": 1.380796,
	"eps": null,
	"exDividendDate": "2024-10-31 00:00:00.0",
	"longDescription": "HEB will seek to achieve its investment objective by obtaining direct or indirect exposure to the constituent securities of the Solactive Equal Weight Canada Banks Index (the 'Equal Weight Bank Index'), in substantially the same proportion as the Equal Weight Bank Index, in order to track such Indexs performance. As an alternative to, or in conjunction with investing in and holding the constituent securities, HEB may also invest in other securities, including Other Funds (as defined herein) to obtain direct or indirect exposure to the constituent securities of the Equal Weight Bank Index in a manner that is consistent with HEBs investment objective. HEB may also hold cash and cash equivalents or other money market instruments in order to meet its obligations. The investment objective of HEB is to replicate, to the extent reasonably possible and before the deduction of fees and expenses, the performance of an equal weight Canadian bank index.",
	"fulldescription": "HEB will seek to achieve its investment objective by obtaining direct or indirect exposure to the constituent securities of the Solactive Equal Weight Canada Banks Index (the 'Equal Weight Bank Index'), in substantially the same proportion as the Equal Weight Bank Index, in order to track such Indexs performance. As an alternative to, or in conjunction with investing in and holding the constituent securities, HEB may also invest in other securities, including Other Funds (as defined herein) to obtain direct or indirect exposure to the constituent securities of the Equal Weight Bank Index in a manner that is consistent with HEBs investment objective. HEB may also hold cash and cash equivalents or other money market instruments in order to meet its obligations. The investment objective of HEB is to replicate, to the extent reasonably possible and before the deduction of fees and expenses, the performance of an equal weight Canadian bank index. The ETF currently seeks to replicate the Solactive Equal Weight Canada Banks Index (or any successor thereto).",
	"website": "www.hamilton-capital.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "55 York Street, Suite 1202, Toronto, Ontario M5J 1R7, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 39588882,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 19.9181818,
	"dividendPayDate": "2024-11-07",
	"weeks52high": 19.92,
	"weeks52low": 14.48,
	"alpha": 0.001776,
	"averageVolume10D": 1716,
	"averageVolume20D": 1434,
	"averageVolume30D": 1325,
	"averageVolume50D": 1790,
	"priceToBook": 1.29,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 19.411161,
	"day50MovingAvg": 19.086103,
	"day200MovingAvg": 17.16227,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 19.92,
	"qmdescription": "",
	"__typename": "Company"
}