{
	"symbol": "HGY",
	"name": "Global X Gold Yield ETF",
	"price": 11.62,
	"priceChange": 0.12,
	"percentChange": 1.043478,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 811,
	"openPrice": 11.59,
	"dayHigh": 11.62,
	"dayLow": 11.59,
	"MarketCap": 74797208,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 11.5,
	"dividendFrequency": "Monthly",
	"dividendYield": 5.168,
	"dividendAmount": 0.05,
	"dividendCurrency": "CAD",
	"beta": 0.624948,
	"eps": null,
	"exDividendDate": "2024-10-31 00:00:00.0",
	"longDescription": "To achieve its investment objective, HGY seeks to achieve its investment objectives by investing, either directly or indirectly, in a portfolio of securities and other instruments that provide exposure to the price of gold bullion. The Gold Portfolio may include gold futures contracts from time to time. The Gold Portfolio was selected by the Manager. The ETF seeks to be fully exposed to the price of gold bullion at all times but does not replicate the performance of gold prices due to the covered call writing strategy and fees and expenses. The ETFs investment manager will, depending on market conditions, write at-the-money or out-of-the-money covered call options on approximately, and not more than, 33 percent of the securities and other instruments in the Gold Portfolio. The level of covered call option writing to which the Gold Portfolio is exposed may vary based on market volatility and other factors.",
	"fulldescription": "To achieve its investment objective, HGY seeks to achieve its investment objectives by investing, either directly or indirectly, in a portfolio of securities and other instruments that provide exposure to the price of gold bullion. The Gold Portfolio may include gold futures contracts from time to time. The Gold Portfolio was selected by the Manager. The ETF seeks to be fully exposed to the price of gold bullion at all times but does not replicate the performance of gold prices due to the covered call writing strategy and fees and expenses. The ETFs investment manager will, depending on market conditions, write at-the-money or out-of-the-money covered call options on approximately, and not more than, 33 percent of the securities and other instruments in the Gold Portfolio. The level of covered call option writing to which the Gold Portfolio is exposed may vary based on market volatility and other factors. The investment objectives of HGY are to provide unitholders with exposure to the price of gold bullion hedged to the Canadian dollar, less the HGYs fees and expenses taxefficient monthly distributions and in order to mitigate downside risk and generate income, exposure to a covered call option writing strategy.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 6436937,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 11.615,
	"dividendPayDate": "2024-11-07",
	"weeks52high": 12,
	"weeks52low": 9.311054,
	"alpha": 0.021086,
	"averageVolume10D": 6157,
	"averageVolume20D": 6252,
	"averageVolume30D": 6788,
	"averageVolume50D": 5140,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 11.559593,
	"day50MovingAvg": 11.503387,
	"day200MovingAvg": 10.572919,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 11.61,
	"qmdescription": "",
	"__typename": "Company"
}