{
	"symbol": "HIG.U",
	"name": "Brompton Global Healthcare Income & Growth ETF",
	"price": 8.71,
	"priceChange": 0.02,
	"percentChange": 0.23015,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Finance",
	"industry": "Asset Management Services",
	"volume": 400,
	"openPrice": 8.71,
	"dayHigh": 8.71,
	"dayLow": 8.71,
	"MarketCap": 457276,
	"MarketCapAllClasses": 0,
	"peRatio": 29.95,
	"prevClose": 8.69,
	"dividendFrequency": "Monthly",
	"dividendYield": 7.569,
	"dividendAmount": 0.055,
	"dividendCurrency": "USD",
	"beta": 0.789175,
	"eps": null,
	"exDividendDate": "2024-11-29 00:00:00.0",
	"longDescription": "Brompton Global Healthcare Income and Growth ETF is designed to provide unitholders with stable monthly cash distributions, the opportunity for capital appreciation, and lower overall volatility of portfolio returns than would otherwise be experienced by owning securities of healthcare companies directly. The Fund seeks to achieve the investment objectives by investing in a portfolio consisting of equity securities of large capitalization healthcare companies. To be considered for inclusion, at the time of investment and at the time of each periodic reconstitution and or rebalancing, each healthcare company must have a market capitalization of at least 5 billion dollars. Each such qualifying healthcare company will be evaluated based on the following metrics among others valuation growth prospects, profitability, liquidity, balance sheet strength, and dividend yield.",
	"fulldescription": "Brompton Global Healthcare Income and Growth ETF is designed to provide unitholders with stable monthly cash distributions, the opportunity for capital appreciation, and lower overall volatility of portfolio returns than would otherwise be experienced by owning securities of healthcare companies directly. The Fund seeks to achieve the investment objectives by investing in a portfolio consisting of equity securities of large capitalization healthcare companies. To be considered for inclusion, at the time of investment and at the time of each periodic reconstitution and or rebalancing, each healthcare company must have a market capitalization of at least 5 billion dollars. Each such qualifying healthcare company will be evaluated based on the following metrics among others valuation growth prospects, profitability, liquidity, balance sheet strength, and dividend yield. After applying these criteria, the Manager will select global healthcare companies, which represent attractive investment opportunities. The Fund may also invest up to 25 Percent of the portfolio, as measured at the time of investment, in equity securities of other companies that have healthcare related activities, provided that the issuers satisfy the market capitalization noted above. The Fund may also invest in one or more other investment funds, including other investment funds managed by the Manager. To reduce volatility and to generate distributable income, the Manager may write covered calls. In addition, the Fund will hedge substantially all of its foreign currency exposure back to the Canadian dollar for its CAD units.",
	"website": "https://www.bromptongroup.com/product/global-healthcare-income-growth-etf/",
	"email": "info@bromptongroup.com",
	"phoneNumber": "416-642-6000",
	"fullAddress": "Bay Wellington Tower, Brookfield Place, 181 Bay Street, Suite 2930, P.O. Box 793, Toronto, Ontario, CA",
	"employees": "",
	"shareOutStanding": 52500,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 8.71,
	"dividendPayDate": "2024-12-13",
	"weeks52high": 9.59,
	"weeks52low": 7.867657,
	"alpha": 0.000635,
	"averageVolume10D": 60,
	"averageVolume20D": 643,
	"averageVolume30D": 430,
	"averageVolume50D": 258,
	"priceToBook": 6.56,
	"priceToCashFlow": "",
	"returnOnEquity": 20.54,
	"returnOnAssets": 7.5,
	"day21MovingAvg": 8.805673,
	"day50MovingAvg": 9.016162,
	"day200MovingAvg": 8.977352,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 8.72,
	"qmdescription": "Asset Management Services",
	"__typename": "Company"
}