{
	"symbol": "HND",
	"name": "BetaPro Natural Gas Inverse Leveraged Daily Bear ETF",
	"price": 75.95,
	"priceChange": 7.59,
	"percentChange": 11.102984,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": "TSX",
	"sector": "",
	"industry": "",
	"volume": 507688,
	"openPrice": 76.16,
	"dayHigh": 78.12,
	"dayLow": 75.05,
	"MarketCap": 41862805,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 68.36,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": -0.173382,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "HND's investment objective was changed after gaining approval at a meeting of shareholders on August 20, 2020 and the name of the ETF was changed to the BetaPro Natural Gas Inverse Leveraged Daily Bear ETF. HNDs new investment objective, which became effective at the close of business on August 27, 2020, is to seek daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to up to two times (200%) the inverse (opposite) of the daily performance of the Horizons Natural Gas Rolling Futures Index (the Underlying Index, Bloomberg ticker: CMDYNGER). HND is denominated in Canadian dollars. Any U.S. dollar gains or losses as a result of the ETFs investment are hedged back to the Canadian dollar to the best of its ability.",
	"fulldescription": "HND's investment objective was changed after gaining approval at a meeting of shareholders on August 20, 2020 and the name of the ETF was changed to the BetaPro Natural Gas Inverse Leveraged Daily Bear ETF. HNDs new investment objective, which became effective at the close of business on August 27, 2020, is to seek daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to up to two times (200%) the inverse (opposite) of the daily performance of the Horizons Natural Gas Rolling Futures Index (the Underlying Index, Bloomberg ticker: CMDYNGER). HND is denominated in Canadian dollars. Any U.S. dollar gains or losses as a result of the ETFs investment are hedged back to the Canadian dollar to the best of its ability. HNDs former investment objective was to seek daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavoured to correspond to two times (200%) the inverse (opposite) of the daily performance of the Solactive Natural Gas Front Month MD Rolling Futures Index ER (the Former Underlying Index, Bloomberg ticker: SOLCNGER). HND is denominated in Canadian dollars. Any U.S. dollar gains or losses as a result of the ETFs investment were hedged back to the Canadian dollar to the best of its ability. To be successful in meeting its former investment objective during the period, HNDs net asset value should have gained approximately two times as much on a given day, on a percentage basis, as its Former Underlying Index de.. To achieve this objective, the total underlying notional value of these instruments will typically not exceed two times the total assets of the ETF. As such, HND employs absolute leverage. Assets not invested in financial instruments may be invested in debt instruments or money market instruments with a term not to exceed 365 days, or reverse repurchase agreements with a term not to exceed 30 days.",
	"website": "www.HorizonsETFs.com",
	"email": "",
	"phoneNumber": "416 933 5745",
	"fullAddress": "26 Wellington St E., Suite 920, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 551189,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 76.4593696,
	"dividendPayDate": null,
	"weeks52high": 133.92,
	"weeks52low": 46.32,
	"alpha": 0.032831,
	"averageVolume10D": 453257,
	"averageVolume20D": 333162,
	"averageVolume30D": 273673,
	"averageVolume50D": 262222,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 89.89571,
	"day50MovingAvg": 85.1192,
	"day200MovingAvg": 89.5801,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 75.95,
	"qmdescription": "",
	"__typename": "Company"
}