{
	"symbol": "HNU",
	"name": "BetaPro Natural Gas Leveraged Daily Bull ETF",
	"price": 26.54,
	"priceChange": -0.3,
	"percentChange": -1.117735,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 626422,
	"openPrice": 26.73,
	"dayHigh": 26.75,
	"dayLow": 26.24,
	"MarketCap": 121489159,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 26.84,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": 0.178587,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "HNUs investment objective, is to seek daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to up to two times 200 Percentage the daily performance of the Horizons Natural Gas Rolling Futures Index the Underlying Index, Bloomberg ticker CMDYNGER. HNU is denominated in Canadian dollars. Any US dollar gains or losses as a result of HNUs investment are hedged back to the Canadian dollar to the best of its ability. The Fund To be successful in meeting its investment objective during the period, HNUs net asset value should have gained up to two times as much on a given day, on a percentage basis, as its Underlying Index rose on that given day. Conversely, HNUs net asset value should have lost up to two times as much on a given day, on a percentage basis, as its Underlying Index declined on that given day.",
	"fulldescription": "HNUs investment objective, is to seek daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to up to two times 200 Percentage the daily performance of the Horizons Natural Gas Rolling Futures Index the Underlying Index, Bloomberg ticker CMDYNGER. HNU is denominated in Canadian dollars. Any US dollar gains or losses as a result of HNUs investment are hedged back to the Canadian dollar to the best of its ability. The Fund To be successful in meeting its investment objective during the period, HNUs net asset value should have gained up to two times as much on a given day, on a percentage basis, as its Underlying Index rose on that given day. Conversely, HNUs net asset value should have lost up to two times as much on a given day, on a percentage basis, as its Underlying Index declined on that given day. HNU takes positions in financial instruments that, in combination, should have had similar daily return characteristics as up to two times 200 Percentage the daily performance of its Underlying Index, which tracks a rolling position in the natural gas futures contract traded on the Chicago Mercantile Exchange the Referenced Futures Contract for a subsequent delivery month. In order to achieve this objective, the total underlying notional value of these instruments will typically",
	"website": "www.HorizonsETFs.com",
	"email": "",
	"phoneNumber": "416 933 5745",
	"fullAddress": "26 Wellington St E., Suite 920, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 4577587,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 26.4328334,
	"dividendPayDate": null,
	"weeks52high": 73.22,
	"weeks52low": 23.28,
	"alpha": -0.000895,
	"averageVolume10D": 955322,
	"averageVolume20D": 859065,
	"averageVolume30D": 758256,
	"averageVolume50D": 621204,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 32.451904,
	"day50MovingAvg": 34.0254,
	"day200MovingAvg": 38.3769,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 26.54,
	"qmdescription": "",
	"__typename": "Company"
}