{
	"symbol": "HQD",
	"name": "BetaPro NASDAQ-100 -2x Daily Bear ETF",
	"price": 10.7,
	"priceChange": -0.02,
	"percentChange": -0.186567,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 2676502,
	"openPrice": 10.77,
	"dayHigh": 10.83,
	"dayLow": 10.69,
	"MarketCap": 55466650,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 10.72,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": -1.608704,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "HQD seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times (200%) the inverse (opposite) of the daily performance of the NASDAQ-100 Index (the Underlying Index, Bloomberg ticker: NDX). HQD is denominated in Canadian dollars. Any U.S. dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of the ETF's ability. If HQD is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as the NASDAQ-100 Index when this Underlying Index declines on that given day. Conversely, HQD's net asset value should lose approximately two times as much on a given day, on a percentage basis, as the NASDAQ-100 Index when this Underlying Index rises on that given day.",
	"fulldescription": "HQD seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times (200%) the inverse (opposite) of the daily performance of the NASDAQ-100 Index (the Underlying Index, Bloomberg ticker: NDX). HQD is denominated in Canadian dollars. Any U.S. dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of the ETF's ability. If HQD is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as the NASDAQ-100 Index when this Underlying Index declines on that given day. Conversely, HQD's net asset value should lose approximately two times as much on a given day, on a percentage basis, as the NASDAQ-100 Index when this Underlying Index rises on that given day. HQD invests in financial instruments that have similar daily return characteristics as two times (200%) the inverse (opposite) of the daily performance of the NASDAQ-100 Index. To achieve this objective, the total underlying notional value of these instruments will typically not exceed two times the total assets of the ETF. As such, HQD employs leverage. Assets not invested in financial instruments may be invested in debt instruments or money market instruments with a term not to exceed 365 days, or reverse repurchase agreements with a term not to exceed 30 days.",
	"website": "www.HorizonsETFs.com",
	"email": "",
	"phoneNumber": "416 933 5745",
	"fullAddress": "26 Wellington St E., Suite 920, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 5183799,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 10.7433014,
	"dividendPayDate": null,
	"weeks52high": 18.23,
	"weeks52low": 10.29,
	"alpha": -0.023152,
	"averageVolume10D": 1263158,
	"averageVolume20D": 1061432,
	"averageVolume30D": 965754,
	"averageVolume50D": 985031,
	"priceToBook": null,
	"priceToCashFlow": 19.3,
	"returnOnEquity": 33.05,
	"returnOnAssets": 13.47,
	"day21MovingAvg": 10.892857,
	"day50MovingAvg": 11.2726,
	"day200MovingAvg": 12.76225,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 10.7,
	"qmdescription": "",
	"__typename": "Company"
}