{
	"symbol": "HUBL",
	"name": "Harvest US Bank Leaders Income ETF",
	"price": 13.49,
	"priceChange": -0.09,
	"percentChange": -0.662739,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 10557,
	"openPrice": 13.57,
	"dayHigh": 13.57,
	"dayLow": 13.48,
	"MarketCap": 115676750,
	"MarketCapAllClasses": 0,
	"peRatio": 12.03,
	"prevClose": 13.58,
	"dividendFrequency": "Monthly",
	"dividendYield": 8.525,
	"dividendAmount": 0.1,
	"dividendCurrency": "CAD",
	"beta": 1.481689,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "The Fund has been created to provide investors with a unique exposure to a portfolio of Equity Securities that are primarily included in the Banks sector of the Global Industry Classification Standards1 and i have a market capitalization that is at least US 10 billion as determined at the time of investment; ii are listed on a US stock exchange; and iii pay a dividend. The Fund's investment objectives are to provide unitholders with monthly cash distributions; and the opportunity for capital appreciation. To achieve its investment objectives, the Fund will invest in an equally weighted portfolio of Equity Securities of not less than 15 US Bank Leaders and not more than 20 US Bank Leaders, chosen from the US Bank Leaders Investable Universe. In order to seek to generate additional returns, the Manager will sell call options on no more than 33 Percentage of the Equity Securities of each US Bank Leader held in the Fund.",
	"fulldescription": "The Fund has been created to provide investors with a unique exposure to a portfolio of Equity Securities that are primarily included in the Banks sector of the Global Industry Classification Standards1 and i have a market capitalization that is at least US 10 billion as determined at the time of investment; ii are listed on a US stock exchange; and iii pay a dividend. The Fund's investment objectives are to provide unitholders with monthly cash distributions; and the opportunity for capital appreciation. To achieve its investment objectives, the Fund will invest in an equally weighted portfolio of Equity Securities of not less than 15 US Bank Leaders and not more than 20 US Bank Leaders, chosen from the US Bank Leaders Investable Universe. In order to seek to generate additional returns, the Manager will sell call options on no more than 33 Percentage of the Equity Securities of each US Bank Leader held in the Fund. At the time of the initial investment and immediately following each quarter reconstitution, the Manager will review and give consideration to select investment characteristics that may include.",
	"website": "www.harvestportfolios.com",
	"email": "info@harvestportfolios.com",
	"phoneNumber": "416 649 4541",
	"fullAddress": "610 Chartwell Rd, Suite 204, Oakville, ON L6J 4A5, Oakville, ON, CA",
	"employees": "",
	"shareOutStanding": 8575000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 13.520673,
	"dividendPayDate": "2025-07-09",
	"weeks52high": 14.87,
	"weeks52low": 10.22,
	"alpha": -0.002586,
	"averageVolume10D": 6113,
	"averageVolume20D": 6572,
	"averageVolume30D": 5422,
	"averageVolume50D": 5584,
	"priceToBook": 1.18,
	"priceToCashFlow": "",
	"returnOnEquity": 11.06,
	"returnOnAssets": 0.94,
	"day21MovingAvg": 12.692186,
	"day50MovingAvg": 12.303332,
	"day200MovingAvg": 12.6009,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 13.49,
	"qmdescription": "",
	"__typename": "Company"
}