{
	"symbol": "HUTL",
	"name": "Harvest Equal Weight Global Utilities Income ETF",
	"price": 18.1,
	"priceChange": 0.07,
	"percentChange": 0.388242,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 3740,
	"openPrice": 18.09,
	"dayHigh": 18.16,
	"dayLow": 18.03,
	"MarketCap": 251590001,
	"MarketCapAllClasses": 0,
	"peRatio": 13.14,
	"prevClose": 18.03,
	"dividendFrequency": "Monthly",
	"dividendYield": 7.869,
	"dividendAmount": 0.1216,
	"dividendCurrency": "CAD",
	"beta": 0.717882,
	"eps": null,
	"exDividendDate": "2024-11-29 00:00:00.0",
	"longDescription": "The Funds investment objectives are to provide unitholders with: (i) monthly cash distributions; (ii) the opportunity for capital appreciation; and (iii) lower overall volatility of portfolio returns than would otherwise be experienced by owning Equity Securities of the Global Utility Issuers directly. The Harvest Equal Weight Global Utilities Income ETF invests in an equally weighted portfolio of Equity Securities of 30 Global Utility Issuers chosen from the Global Utility Issuers Investable Universe that, immediately following each quarterly reconstitution, rank in the top 30 issuers as measured by market capitalization on an equally weighted basis (in Canadian dollars based on the most recent month end value) and that have call options available that, in the determination of the Manager, have sufficient liquidity to meet the Harvest Equal Weight Global Utilities Income ETFs investment objectives.",
	"fulldescription": "The Funds investment objectives are to provide unitholders with: (i) monthly cash distributions; (ii) the opportunity for capital appreciation; and (iii) lower overall volatility of portfolio returns than would otherwise be experienced by owning Equity Securities of the Global Utility Issuers directly. The Harvest Equal Weight Global Utilities Income ETF invests in an equally weighted portfolio of Equity Securities of 30 Global Utility Issuers chosen from the Global Utility Issuers Investable Universe that, immediately following each quarterly reconstitution, rank in the top 30 issuers as measured by market capitalization on an equally weighted basis (in Canadian dollars based on the most recent month end value) and that have call options available that, in the determination of the Manager, have sufficient liquidity to meet the Harvest Equal Weight Global Utilities Income ETFs investment objectives. At each quarterly reconstitution, a buffer rule is applied in order to reduce portfolio turnover: An issuer will only be replaced in the portfolio if it drops out of the top 35 issuers as measured by market capitalization. Such issuer is replaced by a Global Utility Issuer with the largest market capitalization currently not represented in the portfolio (top 30 by market capitalization).",
	"website": "www.harvestportfolios.com",
	"email": "info@harvestportfolios.com",
	"phoneNumber": "416 649 4541",
	"fullAddress": "610 Chartwell Rd, Suite 204, Oakville, ON L6J 4A5, Oakville, ON, CA",
	"employees": "",
	"shareOutStanding": 13900000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 18.0902941,
	"dividendPayDate": "2024-12-09",
	"weeks52high": 18.16,
	"weeks52low": 15.46,
	"alpha": -0.001497,
	"averageVolume10D": 6283,
	"averageVolume20D": 10146,
	"averageVolume30D": 10657,
	"averageVolume50D": 12196,
	"priceToBook": 1.27,
	"priceToCashFlow": 6.1,
	"returnOnEquity": 11.7,
	"returnOnAssets": 3.03,
	"day21MovingAvg": 17.708221,
	"day50MovingAvg": 17.66802,
	"day200MovingAvg": 16.339006,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 18.1,
	"qmdescription": "",
	"__typename": "Company"
}