{
	"symbol": "HUTS",
	"name": "Hamilton Enhanced Utilities ETF",
	"price": 12.97,
	"priceChange": 0.02,
	"percentChange": 0.15444,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 28202,
	"openPrice": 12.96,
	"dayHigh": 12.99,
	"dayLow": 12.95,
	"MarketCap": 142156090,
	"MarketCapAllClasses": 0,
	"peRatio": 11.55,
	"prevClose": 12.95,
	"dividendFrequency": "Monthly",
	"dividendYield": 7.016,
	"dividendAmount": 0.074,
	"dividendCurrency": "CAD",
	"beta": 0.98332,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "HUTS will use leverage in order to achieve its investment objective. Leverage will be created through the use of cash borrowings or as otherwise permitted under applicable securities legislation. HUTS will seek to achieve its investment objective by borrowing cash to invest in and hold a proportionate share of, or a sampling of the constituent securities of, the Solactive Canadian Utility Services High Dividend Index in order to track approximately 1.25 times, the performance of the Utilities Index. As an alternative to, or in conjunction with investing in and holding the constituent securities, HUTS may also invest in other securities, including other investments funds to obtain exposure to the constituent securities of the Utilities Index in a manner that is consistent with its investment objective.",
	"fulldescription": "HUTS will use leverage in order to achieve its investment objective. Leverage will be created through the use of cash borrowings or as otherwise permitted under applicable securities legislation. HUTS will seek to achieve its investment objective by borrowing cash to invest in and hold a proportionate share of, or a sampling of the constituent securities of, the Solactive Canadian Utility Services High Dividend Index in order to track approximately 1.25 times, the performance of the Utilities Index. As an alternative to, or in conjunction with investing in and holding the constituent securities, HUTS may also invest in other securities, including other investments funds to obtain exposure to the constituent securities of the Utilities Index in a manner that is consistent with its investment objective. Currently, it is anticipated that HUTS will initially achieve its investment objective by investing in securities of another appropriate exchange traded fund managed by Horizons the Other ETF. The investment objective of HUTS is to replicate, to the extent reasonably possible and before the deduction of fees  and expenses, a 1.25 times multiple of the performance of a rulesbased utilities index.",
	"website": "www.hamilton-capital.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "55 York Street, Suite 1202, Toronto, Ontario M5J 1R7, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 10960377,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 12.9813829,
	"dividendPayDate": "2025-07-08",
	"weeks52high": 13.78,
	"weeks52low": 11.28,
	"alpha": -0.007878,
	"averageVolume10D": 16687,
	"averageVolume20D": 12352,
	"averageVolume30D": 18509,
	"averageVolume50D": 15838,
	"priceToBook": 0.92,
	"priceToCashFlow": 7.2,
	"returnOnEquity": 9.9,
	"returnOnAssets": 2.95,
	"day21MovingAvg": 12.733744,
	"day50MovingAvg": 12.635806,
	"day200MovingAvg": 12.368194,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 12.97,
	"qmdescription": "",
	"__typename": "Company"
}