{
	"symbol": "HXE",
	"name": "Global X S&P/TSX Capped Energy Index Corporate Class ETF",
	"price": 38.49,
	"priceChange": 0.14,
	"percentChange": 0.365059,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1974,
	"openPrice": 38.45,
	"dayHigh": 38.53,
	"dayLow": 38.45,
	"MarketCap": 97857939,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 38.35,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": 1.775656,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "In order to achieve their investment objectives and obtain direct or indirect exposure to securities of their Underlying Index's Constituent Issuers, the Index ETFs may invest in and hold the securities of Constituent Issuers in substantially the same proportion as they are reflected in the applicable Underlying Index, or may invest in and hold index participation units of exchange traded funds or use derivatives, including but not limited to swap agreements, futures contracts, options on futures contracts, forward contracts, options on securities and indices, money market instruments, reverse repurchase agreements or a combination of the foregoing, that are based on the applicable Underlying Index Horizons HXE seeks to replicate, to the extent possible, the performance of the SPTSX Capped Energy Index (Total Return), net of expenses.",
	"fulldescription": "In order to achieve their investment objectives and obtain direct or indirect exposure to securities of their Underlying Index's Constituent Issuers, the Index ETFs may invest in and hold the securities of Constituent Issuers in substantially the same proportion as they are reflected in the applicable Underlying Index, or may invest in and hold index participation units of exchange traded funds or use derivatives, including but not limited to swap agreements, futures contracts, options on futures contracts, forward contracts, options on securities and indices, money market instruments, reverse repurchase agreements or a combination of the foregoing, that are based on the applicable Underlying Index Horizons HXE seeks to replicate, to the extent possible, the performance of the SPTSX Capped Energy Index (Total Return), net of expenses. The SPTSX Capped Energy Index (Total Return) is designed to measure the performance of Canadian energy sector equity securities included in the SPTSX Composite Index. The Relative Weight of any single index Constituent Security is capped.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 2542425,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 38.4731578,
	"dividendPayDate": null,
	"weeks52high": 40.11,
	"weeks52low": 29.88,
	"alpha": 0.0108,
	"averageVolume10D": 1970,
	"averageVolume20D": 1951,
	"averageVolume30D": 2378,
	"averageVolume50D": 2603,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 36.917618,
	"day50MovingAvg": 36.5506,
	"day200MovingAvg": 36.7372,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 38.49,
	"qmdescription": "",
	"__typename": "Company"
}