{
	"symbol": "HZD",
	"name": "BetaPro Silver -2x Daily Bear ETF",
	"price": 7.17,
	"priceChange": -0.21,
	"percentChange": -2.845528,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 76555,
	"openPrice": 7.26,
	"dayHigh": 7.31,
	"dayLow": 7.14,
	"MarketCap": 3906432,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 7.38,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": -1.520279,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "HZD seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times 200 Percentage the inverse opposite of the daily performance of the Solactive Silver Front Month MD Rolling Futures Index ER the Underlying Index, Bloomberg ticker SOLCSIER. HZD is denominated in Canadian dollars. Any US dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of its ability. The Fund If HZD is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as its Underlying Index declines on that given day. Conversely, HZDs net asset value should lose approximately two times as much on a given day, on a percentage basis, as its Underlying Index rises on that given day.",
	"fulldescription": "HZD seeks daily investment results, before fees, expenses, distributions, brokerage commissions and other transaction costs, that endeavour to correspond to two times 200 Percentage the inverse opposite of the daily performance of the Solactive Silver Front Month MD Rolling Futures Index ER the Underlying Index, Bloomberg ticker SOLCSIER. HZD is denominated in Canadian dollars. Any US dollar gains or losses as a result of the ETFs investment will be hedged back to the Canadian dollar to the best of its ability. The Fund If HZD is successful in meeting its investment objective, its net asset value should gain approximately two times as much on a given day, on a percentage basis, as its Underlying Index declines on that given day. Conversely, HZDs net asset value should lose approximately two times as much on a given day, on a percentage basis, as its Underlying Index rises on that given day. HZD takes positions in financial instruments that, in combination, should have similar daily return characteristics to two times 200 Percentage the inverse opposite of the daily performance of its Underlying Index, which tracks a rolling position in the silver futures contract traded on the Chicago Mercantile Exchange the Referenced Futures Contract for a subsequent delivery month. In order to achieve this objective, the total underlying notional value of these instruments will typically.",
	"website": "www.HorizonsETFs.com",
	"email": "",
	"phoneNumber": "416 933 5745",
	"fullAddress": "26 Wellington St E., Suite 920, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 544830,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 7.16709043,
	"dividendPayDate": null,
	"weeks52high": 16.63,
	"weeks52low": 5.83,
	"alpha": -0.013897,
	"averageVolume10D": 43686,
	"averageVolume20D": 46808,
	"averageVolume30D": 91516,
	"averageVolume50D": 145001,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 6.972381,
	"day50MovingAvg": 7.066,
	"day200MovingAvg": 9.5311,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 7.18,
	"qmdescription": "",
	"__typename": "Company"
}