{
	"symbol": "INAI.F",
	"name": "Invesco Morningstar Global Next Gen AI Index ETF",
	"price": 26.12,
	"priceChange": -0.07,
	"percentChange": -0.267278,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 100,
	"openPrice": 26.12,
	"dayHigh": 26.12,
	"dayLow": 26.12,
	"MarketCap": 11101000,
	"MarketCapAllClasses": 0,
	"peRatio": 36.78,
	"prevClose": 26.19,
	"dividendFrequency": "Quarterly",
	"dividendYield": 0.168,
	"dividendAmount": 0.01202,
	"dividendCurrency": "CAD",
	"beta": -0.296213,
	"eps": null,
	"exDividendDate": "2024-09-27 00:00:00.0",
	"longDescription": "In order to achieve its investment objective, INAI currently holds the Constituent Securities of Morningstar Global  Next Generation Artificial Intelligence Index in approximately the same proportion as they are reflected in that Index  and may use, at the discretion of Invesco Capital, the sampling methodology described in this prospectus. In addition,  or in the alternative, INAI may hold securities of one or more Invesco portfolios that, individually or collectively,  replicate or substantially replicate the Index. In each case, INAI has foreign currency exposure and uses derivative  instruments to seek to hedge this foreign currency exposure of the portion of the portfolio attributable to its CAD  Hedged Units back to the Canadian dollar to the extent that such exposure is hedged by the Index Provider in the  hedged version of the Index.",
	"fulldescription": "In order to achieve its investment objective, INAI currently holds the Constituent Securities of Morningstar Global  Next Generation Artificial Intelligence Index in approximately the same proportion as they are reflected in that Index  and may use, at the discretion of Invesco Capital, the sampling methodology described in this prospectus. In addition,  or in the alternative, INAI may hold securities of one or more Invesco portfolios that, individually or collectively,  replicate or substantially replicate the Index. In each case, INAI has foreign currency exposure and uses derivative  instruments to seek to hedge this foreign currency exposure of the portion of the portfolio attributable to its CAD  Hedged Units back to the Canadian dollar to the extent that such exposure is hedged by the Index Provider in the  hedged version of the Index.   INAI seeks to replicate to the extent reasonably possible and before fees and expenses, the performance of the  Morningstar Global Next Generation Artificial Intelligence Index, or any successor thereto, on an unhedged basis, in  the case of any unhedged units, or on a hedged basis, in the case of any hedged units. This Invesco ETF invests,  directly or indirectly, primarily in global equity securities",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 425000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 26.12,
	"dividendPayDate": "2024-10-07",
	"weeks52high": 26.63,
	"weeks52low": 20.352194,
	"alpha": 0.025078,
	"averageVolume10D": 188,
	"averageVolume20D": 109,
	"averageVolume30D": 279,
	"averageVolume50D": 235,
	"priceToBook": 7.28,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 25.847618,
	"day50MovingAvg": 25.267656,
	"day200MovingAvg": 23.606806,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 26.12,
	"qmdescription": "",
	"__typename": "Company"
}