{
	"symbol": "KLS",
	"name": "Kelso Technologies Inc.",
	"price": 0.155,
	"priceChange": -0.02,
	"percentChange": -11.428572,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Industrials",
	"industry": "Transportation",
	"volume": 500,
	"openPrice": 0.155,
	"dayHigh": 0.155,
	"dayLow": 0.155,
	"MarketCap": 8549814,
	"MarketCapAllClasses": 8549814,
	"peRatio": "",
	"prevClose": 0.175,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": -0.024343,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "Kelso Technologies Inc. ('Kelso' or 'the Company') is a diverse engineering Company that specializes in the creation, production, sales and distribution of proprietary products used in rail and automotive transportation. The Company's rail engineering business has been developed as a designer and reliable domestic supplier of unique high-quality rail tank car valves that provide for the safe handling and containment of hazardous and non-hazardous commodities during rail transport. The automotive division of the Company has created the first proven automated suspension-based Advanced Driver Assistance System for commercial mission-critical wilderness operations. All Kelso products are specifically designed to address the challenging issues of public safety, worker well-being and potential environmental harm while providing effective and efficient operational advantages to customers.",
	"fulldescription": "Kelso Technologies Inc. ('Kelso' or 'the Company') is a diverse engineering Company that specializes in the creation, production, sales and distribution of proprietary products used in rail and automotive transportation. The Company's rail engineering business has been developed as a designer and reliable domestic supplier of unique high-quality rail tank car valves that provide for the safe handling and containment of hazardous and non-hazardous commodities during rail transport. The automotive division of the Company has created the first proven automated suspension-based Advanced Driver Assistance System for commercial mission-critical wilderness operations. All Kelso products are specifically designed to address the challenging issues of public safety, worker well-being and potential environmental harm while providing effective and efficient operational advantages to customers. Kelso's innovation objectives are to create products that diminish the potential dangerous effects of human and technology error through the use of the Company's portfolio of proprietary products.",
	"website": "https://www.kelsotech.com",
	"email": "information@kelsotech.com",
	"phoneNumber": "+1 604 512-2959",
	"fullAddress": "13966, 18B Avenue, Surrey, BC, CA",
	"employees": "45",
	"shareOutStanding": 55160086,
	"totalDebtToEquity": 0.02,
	"totalSharesOutStanding": 55160086,
	"sharesESCROW": 0,
	"vwap": 0.155,
	"dividendPayDate": null,
	"weeks52high": 0.25,
	"weeks52low": 0.105,
	"alpha": -0.01358,
	"averageVolume10D": 22725,
	"averageVolume20D": 21592,
	"averageVolume30D": 21957,
	"averageVolume50D": 34344,
	"priceToBook": 1.35,
	"priceToCashFlow": 11.2,
	"returnOnEquity": -55.46,
	"returnOnAssets": -41.1,
	"day21MovingAvg": 0.15619,
	"day50MovingAvg": 0.1557,
	"day200MovingAvg": 0.1565,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "equity",
	"issueType": "CS",
	"close": 0.155,
	"qmdescription": "Railway Transport & Equipment",
	"__typename": "Company"
}