{
	"symbol": "LLHE.U",
	"name": "Harvest Eli Lilly Enhanced High Income Shares ETF",
	"price": 8.2,
	"priceChange": 0.05,
	"percentChange": 0.613497,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 100,
	"openPrice": 8.2,
	"dayHigh": 8.2,
	"dayLow": 8.2,
	"MarketCap": 3690000,
	"MarketCapAllClasses": 0,
	"peRatio": 69,
	"prevClose": 8.15,
	"dividendFrequency": "Monthly",
	"dividendYield": 26.341,
	"dividendAmount": 0.18,
	"dividendCurrency": "USD",
	"beta": -0.999732,
	"eps": null,
	"exDividendDate": "2025-06-30 00:00:00.0",
	"longDescription": "In order to achieve its investment objectives, Harvest Eli Lilly Enhanced High Income Shares ETF purchases and holds up to 100% of its total assets (including assets acquired with borrowings) in the common stock of Eli Lilly and will write covered call options on shares of Eli Lilly. The proportion of covered call options written will vary depending on market conditions and will be based on the New Harvest ETFs distribution policy, subject to a maximum 50% write level. The New Harvest ETFs covered call strategy will be reviewed monthly to ensure cash flow sustainability according to the New Harvest ETFs distribution policy.",
	"fulldescription": "In order to achieve its investment objectives, Harvest Eli Lilly Enhanced High Income Shares ETF purchases and holds up to 100% of its total assets (including assets acquired with borrowings) in the common stock of Eli Lilly and will write covered call options on shares of Eli Lilly. The proportion of covered call options written will vary depending on market conditions and will be based on the New Harvest ETFs distribution policy, subject to a maximum 50% write level. The New Harvest ETFs covered call strategy will be reviewed monthly to ensure cash flow sustainability according to the New Harvest ETFs distribution policy. Harvest Eli Lilly Enhanced High Income Shares ETF seeks to provide Unitholders with (i) longterm capital appreciation through purchasing and holding, on a levered basis, common stock of Eli Lilly and (ii) high monthly cash distributions",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 450000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 8.19999999,
	"dividendPayDate": "2025-07-09",
	"weeks52high": 12.73,
	"weeks52low": 7.258407,
	"alpha": -0.008657,
	"averageVolume10D": 1571,
	"averageVolume20D": 1131,
	"averageVolume30D": 1248,
	"averageVolume50D": 1222,
	"priceToBook": 51.2,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 8.160143,
	"day50MovingAvg": 8.019657,
	"day200MovingAvg": 8.667593,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 8.2,
	"qmdescription": "",
	"__typename": "Company"
}