{
	"symbol": "MINF",
	"name": "Middlefield Sustainable Infrastructure Dividend ETF",
	"price": 10.1,
	"priceChange": 0.03,
	"percentChange": 0.297915,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 804,
	"openPrice": 10.1,
	"dayHigh": 10.1,
	"dayLow": 10.1,
	"MarketCap": 32726758,
	"MarketCapAllClasses": 0,
	"peRatio": 9.06,
	"prevClose": 10.07,
	"dividendFrequency": "Monthly",
	"dividendYield": 4.946,
	"dividendAmount": 0.04167,
	"dividendCurrency": "CAD",
	"beta": 0.594204,
	"eps": null,
	"exDividendDate": "2024-11-30 00:00:00.0",
	"longDescription": "The investment objectives of Middlefield Sustainable Infrastructure Dividend ETF formerly Sustainable Infrastructure Dividend Fund the Fund are to provide holders of units with: i stable monthly cash distributions; and ii enhanced long-term total return through capital appreciation. The Fund's investment portfolio.",
	"fulldescription": "The investment objectives of Middlefield Sustainable Infrastructure Dividend ETF formerly Sustainable Infrastructure Dividend Fund the Fund are to provide holders of units with: i stable monthly cash distributions; and ii enhanced long-term total return through capital appreciation. The Fund's investment portfolio. The Fund utilizes an investment strategy which focuses primarily on investing in a diversified, actively managed portfolio comprised primarily of dividend paying securities of global issuers operating in, or that derive a significant portion of their revenue or earnings from, products or services related to physical infrastructure assets and related industries such as utilities, water and smart grids, energy transmission and storage, renewable power generation, towers and communication, data centres and clean technologies, which have been analyzed by the Advisor as defined below based on environmental, social and governance considerations as a complement to the Advisors fundamental analysis, and which the Advisor believes have competitive advantages.",
	"website": "",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "CA",
	"employees": "",
	"shareOutStanding": 3240273,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 10.1,
	"dividendPayDate": "2024-12-13",
	"weeks52high": 10.17,
	"weeks52low": 8.25739,
	"alpha": -0.002069,
	"averageVolume10D": 502,
	"averageVolume20D": 549,
	"averageVolume30D": 879,
	"averageVolume50D": 672,
	"priceToBook": 1.1,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 9.905894,
	"day50MovingAvg": 9.97536,
	"day200MovingAvg": 9.366874,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 10.11,
	"qmdescription": "",
	"__typename": "Company"
}