{
	"symbol": "PME",
	"name": "Sentry Select Primary Metals Corp. Class A Shares",
	"price": 2.43,
	"priceChange": 0.06,
	"percentChange": 2.531646,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 3710,
	"openPrice": 2.39,
	"dayHigh": 2.43,
	"dayLow": 2.39,
	"MarketCap": 16549421,
	"MarketCapAllClasses": 19297722,
	"peRatio": 9.9,
	"prevClose": 2.37,
	"dividendFrequency": "Monthly",
	"dividendYield": 7.407,
	"dividendAmount": 0.015,
	"dividendCurrency": "CAD",
	"beta": 1.169959,
	"eps": 1.98,
	"exDividendDate": "2024-11-29 00:00:00.0",
	"longDescription": "The Corporations investment objective is to provide Shareholders with long-term capital appreciation.  The assets of the Corporation are invested in a Portfolio consisting primarily of securities of issuers that are engaged in the production and/or exploration of metal and minerals, with a current focus on gold issuers. The Manager actively manages the Corporation's investments, which includes rotation of weightings within different metals and minerals. The Manager uses a combination of a top-down and value driven, bottom-up analysis to identify issuers for the Portfolio.",
	"fulldescription": "The Corporations investment objective is to provide Shareholders with long-term capital appreciation.  The assets of the Corporation are invested in a Portfolio consisting primarily of securities of issuers that are engaged in the production and/or exploration of metal and minerals, with a current focus on gold issuers. The Manager actively manages the Corporation's investments, which includes rotation of weightings within different metals and minerals. The Manager uses a combination of a top-down and value driven, bottom-up analysis to identify issuers for the Portfolio. The Manager intends to focus on equities with: ¿ high cash flow and free cash flow yields on invested capital; ¿ low multiples to NAV based on below market metal price assumptions; ¿ undervalued, in-development metal and mineral deposits that are expected to grow in value as they advance to production; ¿ advanced exploration deposits that the Manager considers to have a high probability of commercial viability and substantial potential for expansion prior to commencement of feasibility studies and production financing; and ¿ discounted financing opportunities, particularly those with additional leverage from warrants. From time to time the Portfolio will include cash and cash equivalents which may at times constitute a significant portion of the Portfolio. The Manager believes that in ordinary market conditions, cash and cash equivalents would constitute less than 10% of the NAV of the Portfolio. Subject to the Corporation's investment restrictions, the Manager may from time to time purchase physical metals and/or minerals. The Manager may, on behalf of the Corporation, from time to time, purchase futures, forward contracts, options on metals and/or minerals, and any other derivative contract relating to metals and/or minerals. The Manager may update the investment focus to securities of issuers that are engaged in the production of and/or exploration for, Other Metals.",
	"website": "www.sentry.ca",
	"email": "info@sentryselect.com",
	"phoneNumber": "+1 416 8618729",
	"fullAddress": "199 Bay Street, Suite 4100,PO Box 108, Commerce Court Postal Station, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 6810461,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 7941449,
	"sharesESCROW": null,
	"vwap": 2.39864864,
	"dividendPayDate": "2024-12-13",
	"weeks52high": 2.8,
	"weeks52low": 1.77,
	"alpha": 0.005107,
	"averageVolume10D": 4616,
	"averageVolume20D": 5197,
	"averageVolume30D": 4803,
	"averageVolume50D": 5059,
	"priceToBook": 1.53,
	"priceToCashFlow": 2.2,
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 2.403359,
	"day50MovingAvg": 2.410737,
	"day200MovingAvg": 2.129866,
	"dividend3Years": "",
	"dividend5Years": 0,
	"datatype": "equity",
	"issueType": "CE",
	"close": 2.43,
	"qmdescription": "",
	"__typename": "Company"
}