{
	"symbol": "QIE",
	"name": "AGF Systematic International Equity ETF",
	"price": 32.46,
	"priceChange": 0.23,
	"percentChange": 0.713621,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1200,
	"openPrice": 32.46,
	"dayHigh": 32.46,
	"dayLow": 32.46,
	"MarketCap": 66543000,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 32.23,
	"dividendFrequency": "Annual",
	"dividendYield": 2.601,
	"dividendAmount": 0.841494,
	"dividendCurrency": "CAD",
	"beta": 0.688067,
	"eps": null,
	"exDividendDate": "2023-12-28 00:00:00.0",
	"longDescription": "The AGFiQ International Equity ETF seeks to provide long term capital appreciation with reduced volatility, over a full market cycle, by investing primarily in equity securities of issuers in Europe, Australasia and the Far East. In seeking to achieve its investment objective, the AGFiQ International Equity ETF uses a quantitative model to evaluate international securities of large and mid capitalization issuers utilizing a minimum variance approach, in order to construct a portfolio that minimizes portfolio volatility. The quantitative model also evaluates international securities based on factors that identify growth, value, quality and risk characteristics.",
	"fulldescription": "The AGFiQ International Equity ETF seeks to provide long term capital appreciation with reduced volatility, over a full market cycle, by investing primarily in equity securities of issuers in Europe, Australasia and the Far East. In seeking to achieve its investment objective, the AGFiQ International Equity ETF uses a quantitative model to evaluate international securities of large and mid capitalization issuers utilizing a minimum variance approach, in order to construct a portfolio that minimizes portfolio volatility. The quantitative model also evaluates international securities based on factors that identify growth, value, quality and risk characteristics. Although the AGFiQ International Equity ETF's investments are selected based on the output of its quantitative model, the portfolio incorporates constraints/controls (in relation to country, industry, group, sector and individual security concentrations) that are designed to foster portfolio diversification, liquidity and risk mitigation. If and where necessary, to gain exposure to global markets, AGF may invest in a wide array of ETFs, including regional, country, market capitalization and/or sector based ETFs. The portfolio asset allocation will be reconstituted and rebalanced on a monthly basis but has the latitude to rebalance on an ad hoc basis should market conditions dictate.",
	"website": "www.agf.com",
	"email": "",
	"phoneNumber": "",
	"fullAddress": "TD Bank Tower, 66 Wellington Street West, Suite 3100, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 2050000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 32.46,
	"dividendPayDate": "2024-01-05",
	"weeks52high": 33.74,
	"weeks52low": 28.890301,
	"alpha": 0.000175,
	"averageVolume10D": 1270,
	"averageVolume20D": 1255,
	"averageVolume30D": 1813,
	"averageVolume50D": 1540,
	"priceToBook": null,
	"priceToCashFlow": 9.2,
	"returnOnEquity": 17.2,
	"returnOnAssets": 6.27,
	"day21MovingAvg": 32.574287,
	"day50MovingAvg": 32.9356,
	"day200MovingAvg": 32.3141,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 32.35,
	"qmdescription": "",
	"__typename": "Company"
}