{
	"symbol": "QQCE",
	"name": "Invesco ESG NASDAQ 100 Index ETF",
	"price": 31.22,
	"priceChange": -0.06,
	"percentChange": -0.191816,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1121,
	"openPrice": 31.15,
	"dayHigh": 31.22,
	"dayLow": 31.08,
	"MarketCap": 485471000,
	"MarketCapAllClasses": 0,
	"peRatio": 71.87,
	"prevClose": 31.28,
	"dividendFrequency": "Quarterly",
	"dividendYield": 0.379,
	"dividendAmount": 0.03058,
	"dividendCurrency": "CAD",
	"beta": 0.857963,
	"eps": null,
	"exDividendDate": "2025-06-27 00:00:00.0",
	"longDescription": "QQCE seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of the Nasdaq-100 ESG Index, or any successor thereto, on an unhedged basis, in the case of any unhedged units, or on a hedged basis, in the case of any hedged units. In order to achieve its investment objective, QQCE currently holds the Constituent Securities of the Nasdaq-100 ESG Index in approximately the same proportion as they are reflected in that Index and may use, at the discretion of the Sub-advisor, the sampling methodology described in the prospectus. In addition or in the alternative, QQCE may hold securities of one or more Invesco portfolios that, individually or collectively, replicate or substantially replicate the applicable Index.",
	"fulldescription": "QQCE seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of the Nasdaq-100 ESG Index, or any successor thereto, on an unhedged basis, in the case of any unhedged units, or on a hedged basis, in the case of any hedged units. In order to achieve its investment objective, QQCE currently holds the Constituent Securities of the Nasdaq-100 ESG Index in approximately the same proportion as they are reflected in that Index and may use, at the discretion of the Sub-advisor, the sampling methodology described in the prospectus. In addition or in the alternative, QQCE may hold securities of one or more Invesco portfolios that, individually or collectively, replicate or substantially replicate the applicable Index. In each case, QQCE uses derivative instruments to seek to hedge the foreign currency exposure of the portion of the portfolio attributable to its CAD Hedged Units back to the Canadian dollar to the extent that such exposure is hedged by the Index Provider in the hedged version of the Index",
	"website": "www.invesco.ca",
	"email": "",
	"phoneNumber": "+1 8008746275",
	"fullAddress": "5140 Yonge Street, Suite 900, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 15550000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 31.1518181,
	"dividendPayDate": "2025-07-08",
	"weeks52high": 31.61,
	"weeks52low": 23.98,
	"alpha": 0.00605,
	"averageVolume10D": 8053,
	"averageVolume20D": 28073,
	"averageVolume30D": 19598,
	"averageVolume50D": 12666,
	"priceToBook": 8.16,
	"priceToCashFlow": 20.3,
	"returnOnEquity": 35.92,
	"returnOnAssets": 14.19,
	"day21MovingAvg": 30.297329,
	"day50MovingAvg": 29.33222,
	"day200MovingAvg": 29.076763,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 31.22,
	"qmdescription": "",
	"__typename": "Company"
}