{
	"symbol": "QQEQ",
	"name": "Invesco NASDAQ 100 Equal Weight Index ETF",
	"price": 28.52,
	"priceChange": 0.26,
	"percentChange": 0.920028,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 101,
	"openPrice": 28.52,
	"dayHigh": 28.52,
	"dayLow": 28.52,
	"MarketCap": 11408000,
	"MarketCapAllClasses": 0,
	"peRatio": 28.38,
	"prevClose": 28.26,
	"dividendFrequency": "Quarterly",
	"dividendYield": 0.799,
	"dividendAmount": 0.03855,
	"dividendCurrency": "CAD",
	"beta": 0.824965,
	"eps": null,
	"exDividendDate": "2024-09-27 00:00:00.0",
	"longDescription": "Our objectives are to obtain reasonable assurance about whether the financial statement as a whole for each Fund is free from material misstatement, whether due to fraud or error, and to issue an auditors report that includes our opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with Canadian generally accepted auditing standards will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of the financial statement of each fund.",
	"fulldescription": "Our objectives are to obtain reasonable assurance about whether the financial statement as a whole for each Fund is free from material misstatement, whether due to fraud or error, and to issue an auditors report that includes our opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with Canadian generally accepted auditing standards will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of the financial statement of each fund.  In order to achieve its investment objective, QQEQ currently holds the Constituent Securities of the Nasdaq-100 Equal Weighted Index in approximately the same proportion as they are reflected in that Index and may use, at the discretion of Invesco Capital, the sampling methodology described in the prospectus. In addition or in the alternative, QQEQ may hold securities of one or more Invesco portfolios that, individually or collectively, replicate or substantially replicate the applicable Index. In each case, QQEQ uses derivative instruments to seek to hedge the foreign currency exposure of the portion of the portfolio attributable to its CAD Hedged Units back to the Canadian dollar to the extent that such exposure is hedged by the Index Provider in the hedged version of the Index. ",
	"website": "www.invesco.ca",
	"email": "",
	"phoneNumber": "+1 8008746275",
	"fullAddress": "5140 Yonge Street, Suite 900, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 400000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 28.52,
	"dividendPayDate": "2024-10-07",
	"weeks52high": 28.52,
	"weeks52low": 22.883051,
	"alpha": 0.004009,
	"averageVolume10D": 252,
	"averageVolume20D": 516,
	"averageVolume30D": 451,
	"averageVolume50D": 428,
	"priceToBook": 4.73,
	"priceToCashFlow": 17.1,
	"returnOnEquity": 22.82,
	"returnOnAssets": 8.34,
	"day21MovingAvg": 27.825714,
	"day50MovingAvg": 27.141361,
	"day200MovingAvg": 26.166887,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 28.52,
	"qmdescription": "",
	"__typename": "Company"
}