{
	"symbol": "QQJE.F",
	"name": "Invesco ESG NASDAQ Next Gen 100 Index ETF",
	"price": 17.55,
	"priceChange": -0.4,
	"percentChange": -2.228412,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 877500,
	"MarketCapAllClasses": 0,
	"peRatio": 24.92,
	"prevClose": 17.95,
	"dividendFrequency": "Quarterly",
	"dividendYield": 0.413,
	"dividendAmount": 0.01494,
	"dividendCurrency": "CAD",
	"beta": 1.231168,
	"eps": null,
	"exDividendDate": "2024-09-27 00:00:00.0",
	"longDescription": "QQJE seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of the Nasdaq Next Generation 100 ESGTM Index, or any successor thereto, on an unhedged basis, in the case of any unhedged units, or on a hedged basis, in the case of any hedged units. This Invesco ETF invests, directly or indirectly, primarily in equity securities of companies listed on The Nasdaq Stock Market LLC.  In order to achieve its investment objective, QQJE currently holds the Constituent Securities of the Nasdaq Next Generation 100 ESGTM Index in approximately the same proportion as they are reflected in that Index and may use, at the discretion of the Sub-advisor, the sampling methodology described in the prospectus. In addition or in the alternative, QQJE may hold securities of one or more Invesco portfolios that, individually or collectively, replicate or substantially replicate the applicable Index.",
	"fulldescription": "QQJE seeks to replicate, to the extent reasonably possible and before fees and expenses, the performance of the Nasdaq Next Generation 100 ESGTM Index, or any successor thereto, on an unhedged basis, in the case of any unhedged units, or on a hedged basis, in the case of any hedged units. This Invesco ETF invests, directly or indirectly, primarily in equity securities of companies listed on The Nasdaq Stock Market LLC.  In order to achieve its investment objective, QQJE currently holds the Constituent Securities of the Nasdaq Next Generation 100 ESGTM Index in approximately the same proportion as they are reflected in that Index and may use, at the discretion of the Sub-advisor, the sampling methodology described in the prospectus. In addition or in the alternative, QQJE may hold securities of one or more Invesco portfolios that, individually or collectively, replicate or substantially replicate the applicable Index. In each case, QQJE uses derivative instruments to seek to hedge the foreign currency exposure of the portion of the portfolio attributable to its CAD Hedged Units back to the Canadian dollar to the extent that such exposure is hedged by the Index Provider in the hedged version of the Index",
	"website": "www.invesco.ca",
	"email": "",
	"phoneNumber": "+1 8008746275",
	"fullAddress": "5140 Yonge Street, Suite 900, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 50000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2024-10-07",
	"weeks52high": 18.31,
	"weeks52low": 14.364373,
	"alpha": -0.00745,
	"averageVolume10D": 0,
	"averageVolume20D": 250,
	"averageVolume30D": 167,
	"averageVolume50D": 100,
	"priceToBook": 3.57,
	"priceToCashFlow": 15.1,
	"returnOnEquity": 21.33,
	"returnOnAssets": 6.86,
	"day21MovingAvg": 17.703333,
	"day50MovingAvg": 17.61528,
	"day200MovingAvg": 16.800451,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 18.1,
	"qmdescription": "",
	"__typename": "Company"
}