{
	"symbol": "RIDH",
	"name": "RBC Quant EAFE Dividend Leaders (CAD Hedged) ETF",
	"price": 31.38,
	"priceChange": -0.32,
	"percentChange": -1.009464,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1489,
	"openPrice": 31.57,
	"dayHigh": 31.57,
	"dayLow": 31.38,
	"MarketCap": 65113500,
	"MarketCapAllClasses": 0,
	"peRatio": 11.04,
	"prevClose": 31.7,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.433,
	"dividendAmount": 0.085,
	"dividendCurrency": "CAD",
	"beta": 0.717029,
	"eps": null,
	"exDividendDate": "2025-06-23 00:00:00.0",
	"longDescription": "The ETF seeks to provide unitholders with exposure, either directly or indirectly through investment in other funds managed by RBC GAM or an affiliate of RBC GAM, to the performance of a diversified portfolio of high quality equity securities in markets in Europe, Australasia and the Far East (EAFE) that are expected to provide regular income from dividends and that have the potential for long term capital growth, while seeking to minimize the exposure to currency fluctuations between foreign currencies and the Canadian dollar. The ETF intends to invest substantially all of its assets in units of the RBC Quant EAFE Dividend Leaders ETF (the underlying RBC ETF) but may also invest directly in a portfolio of dividend paying equity securities in markets in Europe, Australasia and the Far East.",
	"fulldescription": "The ETF seeks to provide unitholders with exposure, either directly or indirectly through investment in other funds managed by RBC GAM or an affiliate of RBC GAM, to the performance of a diversified portfolio of high quality equity securities in markets in Europe, Australasia and the Far East (EAFE) that are expected to provide regular income from dividends and that have the potential for long term capital growth, while seeking to minimize the exposure to currency fluctuations between foreign currencies and the Canadian dollar. The ETF intends to invest substantially all of its assets in units of the RBC Quant EAFE Dividend Leaders ETF (the underlying RBC ETF) but may also invest directly in a portfolio of dividend paying equity securities in markets in Europe, Australasia and the Far East. Portfolio securities for the underlying RBC ETF (and for the ETF, to the extent it invests directly in equity securities) will be selected and weighted using a rules based, multi factor investment approach that considers a companys balance sheet strength, the stability and sustainability of its dividend payout and/or its ability to pay or grow dividends in the future. The portfolio holdings will be reconstituted and rebalanced on a quarterly basis. The frequency of the reconstitution and rebalancing may change without notice.",
	"website": "www.rbcgam.com",
	"email": "globalconsultantdatabase@rbc.com",
	"phoneNumber": "416-974-0616",
	"fullAddress": "155 Wellington Street West, Suite 2200, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 2075000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 31.4661538,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 31.78,
	"weeks52low": 26.238602,
	"alpha": 0.003975,
	"averageVolume10D": 760,
	"averageVolume20D": 1025,
	"averageVolume30D": 789,
	"averageVolume50D": 828,
	"priceToBook": 0.18,
	"priceToCashFlow": 6.7,
	"returnOnEquity": 23.48,
	"returnOnAssets": 9.2,
	"day21MovingAvg": 31.40613,
	"day50MovingAvg": 30.952953,
	"day200MovingAvg": 29.426853,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 31.46,
	"qmdescription": "",
	"__typename": "Company"
}