{
	"symbol": "RLB",
	"name": "RBC 1-5 Year Laddered Canadian Bond ETF",
	"price": 18.87,
	"priceChange": 0.02,
	"percentChange": 0.106101,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 175,
	"openPrice": 18.87,
	"dayHigh": 18.87,
	"dayLow": 18.87,
	"MarketCap": 127372500,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 18.85,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.22,
	"dividendAmount": 0.05,
	"dividendCurrency": "CAD",
	"beta": 0.088963,
	"eps": null,
	"exDividendDate": "2025-06-23 00:00:00.0",
	"longDescription": "The RBC 1-5 Year Laddered Canadian Bond ETF seeks to provide unitholders with exposure primarily to the performance of a diversified portfolio of Canadian corporate and government bonds, divided (laddered) into five groupings with staggered maturities from one to five years, that will provide regular income while preserving capital. The RBC 1-5 Year Laddered Canadian Bond ETF will achieve exposure to Canadian corporate and government bonds primarily by investing in a portfolio of five equally weighted sub portfolios, each of which is targeted to provide at least 30% exposure to government bonds and no more than 70% exposure to corporate bonds. The portfolios may deviate at times from their targeted weights due to market fluctuations between rebalance periods. The government bond exposure will be obtained by direct investment in one or more government bonds.",
	"fulldescription": "The RBC 1-5 Year Laddered Canadian Bond ETF seeks to provide unitholders with exposure primarily to the performance of a diversified portfolio of Canadian corporate and government bonds, divided (laddered) into five groupings with staggered maturities from one to five years, that will provide regular income while preserving capital. The RBC 1-5 Year Laddered Canadian Bond ETF will achieve exposure to Canadian corporate and government bonds primarily by investing in a portfolio of five equally weighted sub portfolios, each of which is targeted to provide at least 30% exposure to government bonds and no more than 70% exposure to corporate bonds. The portfolios may deviate at times from their targeted weights due to market fluctuations between rebalance periods. The government bond exposure will be obtained by direct investment in one or more government bonds. The decision to invest in each government bond is based on RBC GAMs assessment of each bond's term to maturity, credit quality, yield to maturity and an overall emphasis on issuer diversification. In addition, the decision to invest in each government bond also incorporates material ESG factors as part of the investment process to consider issuers oversight and management of these material ESG factors. The corporate bond exposure will be obtained primarily by investing in an appropriate RBC Target Maturity Corporate Bond ETF.",
	"website": "www.rbcgam.com",
	"email": "rbcgam-databases@rbc.com",
	"phoneNumber": "416-974-0616",
	"fullAddress": "155 Wellington Street West, Suite 2200, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 6750000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 18.87,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 18.97,
	"weeks52low": 17.687069,
	"alpha": 0.000658,
	"averageVolume10D": 1350,
	"averageVolume20D": 981,
	"averageVolume30D": 1320,
	"averageVolume50D": 1036,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 18.832905,
	"day50MovingAvg": 18.807072,
	"day200MovingAvg": 18.558052,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 18.87,
	"qmdescription": "",
	"__typename": "Company"
}