{
	"symbol": "SBC",
	"name": "Brompton Split Banc Corp. Class A Shares",
	"price": 10.32,
	"priceChange": 0.03,
	"percentChange": 0.291545,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Finance",
	"industry": "Asset Management Services",
	"volume": 31220,
	"openPrice": 10.3,
	"dayHigh": 10.38,
	"dayLow": 10.28,
	"MarketCap": 229643375,
	"MarketCapAllClasses": 211252526,
	"peRatio": 12.73,
	"prevClose": 10.29,
	"dividendFrequency": "Monthly",
	"dividendYield": 11.628,
	"dividendAmount": 0.1,
	"dividendCurrency": "CAD",
	"beta": 1.529109,
	"eps": 0.86,
	"exDividendDate": "2024-11-29 00:00:00.0",
	"longDescription": "The investment objectives for the Preferred Shares are to provide their holders with fixed cumulative preferential quarterly cash distributions and to return the original issue price to holders of Preferred Shares on the Maturity Date. The investment objectives for the Class A Shares are to provide their holders with regular monthly cash distributions targeted to be at least $0.10 per Class A Share representing a yield on the issue price of the Class A Shares offered hereunder of 13.2% per annum and to provide holders of Class A Shares with the opportunity for growth in NAV per Class A Share... In order to achieve its investment objectives, the Company invests in a portfolio, on an approximately equal weighted basis, of common shares of the six largest Canadian banks (currently Bank of Montreal, Canadian Imperial Bank of Commerce, National Bank of Canada, Royal Bank of Canada, The Bank of Nova Scotia and The Toronto-Dominion Bank (collectively, the Banks)).",
	"fulldescription": "The investment objectives for the Preferred Shares are to provide their holders with fixed cumulative preferential quarterly cash distributions and to return the original issue price to holders of Preferred Shares on the Maturity Date. The investment objectives for the Class A Shares are to provide their holders with regular monthly cash distributions targeted to be at least $0.10 per Class A Share representing a yield on the issue price of the Class A Shares offered hereunder of 13.2% per annum and to provide holders of Class A Shares with the opportunity for growth in NAV per Class A Share... In order to achieve its investment objectives, the Company invests in a portfolio, on an approximately equal weighted basis, of common shares of the six largest Canadian banks (currently Bank of Montreal, Canadian Imperial Bank of Commerce, National Bank of Canada, Royal Bank of Canada, The Bank of Nova Scotia and The Toronto-Dominion Bank (collectively, the Banks)). In addition, the Company may hold up to 10% of the total assets of the Portfolio in investments in global financial companies for the purposes of enhanced diversification and return potential, at the discretion of the Manager. The Portfolio may contain the common shares of less than six Banks as a result of the impact of a merger, acquisition or other significant corporate actions or events affecting one or more of the Banks. Holdings in the six Banks will generally be equal-weighted at each rebalancing of the Portfolio, however the Company may at the Managers discretion, hold non-equal-weight positions. The Manager is res",
	"website": "https://www.bromptongroup.com",
	"email": "info@bromptongroup.com",
	"phoneNumber": "+1 416 642-9055",
	"fullAddress": "181 Bay Street,Suite 2930, Bay Wellington Tower, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 22252265,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 20470206,
	"sharesESCROW": null,
	"vwap": 10.3249838,
	"dividendPayDate": "2024-12-13",
	"weeks52high": 10.75,
	"weeks52low": 7.75,
	"alpha": 0.001513,
	"averageVolume10D": 27472,
	"averageVolume20D": 27022,
	"averageVolume30D": 26742,
	"averageVolume50D": 26317,
	"priceToBook": 1.3,
	"priceToCashFlow": -2.2,
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 10.283819,
	"day50MovingAvg": 10.014847,
	"day200MovingAvg": 8.83685,
	"dividend3Years": "",
	"dividend5Years": 0,
	"datatype": "equity",
	"issueType": "CS",
	"close": 10.32,
	"qmdescription": "Asset Management Services",
	"__typename": "Company"
}