{
	"symbol": "TINF",
	"name": "TD Active Global Infrastructure Equity ETF",
	"price": 22.87,
	"priceChange": 0.07,
	"percentChange": 0.307018,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 16315,
	"openPrice": 22.8,
	"dayHigh": 22.88,
	"dayLow": 22.77,
	"MarketCap": 179529500,
	"MarketCapAllClasses": 0,
	"peRatio": 46.85,
	"prevClose": 22.8,
	"dividendFrequency": "Quarterly",
	"dividendYield": 2.798,
	"dividendAmount": 0.17,
	"dividendCurrency": "CAD",
	"beta": 0.736564,
	"eps": null,
	"exDividendDate": "2025-06-27 00:00:00.0",
	"longDescription": "The investment objective of TD Active Global Infrastructure Equity ETF (the Fund) is to seek to earn income and achieve long-term capital appreciation Fund investing primarily in common equities, equity-linked notes, convertible securities, preferred shares or other equity-type securities of companies that own or operate infrastructure assets located anywhere in the world. In seeking to achieve this objective, the Fund invests primarily in a globally diversified portfolio of publicly listed companies that own or operate infrastructure assets which can include, but is not limited to, transportation, power generation, renewable energy, pipelines, utilities, telecommunications and social infrastructure. The Fund employs a bottom-up strategy to identify companies that have potential for, and can sustain, above-average growth.",
	"fulldescription": "The investment objective of TD Active Global Infrastructure Equity ETF (the Fund) is to seek to earn income and achieve long-term capital appreciation Fund investing primarily in common equities, equity-linked notes, convertible securities, preferred shares or other equity-type securities of companies that own or operate infrastructure assets located anywhere in the world. In seeking to achieve this objective, the Fund invests primarily in a globally diversified portfolio of publicly listed companies that own or operate infrastructure assets which can include, but is not limited to, transportation, power generation, renewable energy, pipelines, utilities, telecommunications and social infrastructure. The Fund employs a bottom-up strategy to identify companies that have potential for, and can sustain, above-average growth. Modeling analytics of stocks, sub-industry and country contribution are utilized to optimize the Funds overall risk exposures relative to its benchmark, the S&P Global Infrastructure Index.",
	"website": "www.tdam.com",
	"email": "info@tdqc.com",
	"phoneNumber": "800-588-8054",
	"fullAddress": "P.O. Box 100, 66 Wellington Street West, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 7850000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 22.857716,
	"dividendPayDate": "2025-07-08",
	"weeks52high": 23.19,
	"weeks52low": 18.81,
	"alpha": 0.003551,
	"averageVolume10D": 21081,
	"averageVolume20D": 20527,
	"averageVolume30D": 19801,
	"averageVolume50D": 16910,
	"priceToBook": 2.77,
	"priceToCashFlow": 9.9,
	"returnOnEquity": 14.18,
	"returnOnAssets": 4.75,
	"day21MovingAvg": 22.717815,
	"day50MovingAvg": 22.539328,
	"day200MovingAvg": 21.485926,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 22.87,
	"qmdescription": "",
	"__typename": "Company"
}