{
	"symbol": "TLF",
	"name": "Brompton Tech Leaders Income ETF",
	"price": 25.29,
	"priceChange": -0.02,
	"percentChange": -0.07902,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 2300,
	"openPrice": 25.3,
	"dayHigh": 25.3,
	"dayLow": 25.17,
	"MarketCap": 131154370,
	"MarketCapAllClasses": 0,
	"peRatio": 40.66,
	"prevClose": 25.31,
	"dividendFrequency": "Monthly",
	"dividendYield": 5.733,
	"dividendAmount": 0.125,
	"dividendCurrency": "CAD",
	"beta": 0.937557,
	"eps": null,
	"exDividendDate": "2024-11-29 00:00:00.0",
	"longDescription": "The Funds investment objectives are to provide unitholders with stable monthly cash distributions, the opportunity for capital appreciation and lower overall volatility of portfolio returns than would otherwise be experienced by owning securities of technology companies directly. The Fund seeks to achieve the investment objectives by investing in a portfolio comprised of large capitalization primarily North American listed technology companies. To be considered for inclusion in the portfolio, at the time of investment and at the time of each periodic reconstruction and or rebalancing, each technology company must have a market capitalization of at least 10 billion dollars. Each such qualifying technology company will be evaluated based on the following metrics among others growth value profitability liquidity and balance sheet strength. The Fund may also invest up to 25 Percent of total assets in other technology related companies or non North American listed technology companies.",
	"fulldescription": "The Funds investment objectives are to provide unitholders with stable monthly cash distributions, the opportunity for capital appreciation and lower overall volatility of portfolio returns than would otherwise be experienced by owning securities of technology companies directly. The Fund seeks to achieve the investment objectives by investing in a portfolio comprised of large capitalization primarily North American listed technology companies. To be considered for inclusion in the portfolio, at the time of investment and at the time of each periodic reconstruction and or rebalancing, each technology company must have a market capitalization of at least 10 billion dollars. Each such qualifying technology company will be evaluated based on the following metrics among others growth value profitability liquidity and balance sheet strength. The Fund may also invest up to 25 Percent of total assets in other technology related companies or non North American listed technology companies. In order to earn option premiums and to reduce volatility and to generate distributable income, the Manager may write covered calls. In addition, the Fund will hedge substantially all of its foreign currency exposure back to the Canadian dollar for its CAD units.",
	"website": "www.bromptongroup.com",
	"email": "info@bromptongroup.com",
	"phoneNumber": "416-642-6000",
	"fullAddress": "Bay Wellington Tower, Brookfield Place, 181 Bay Street, Suite 2930, P.O. Box 793, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 5186017,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 25.2408695,
	"dividendPayDate": "2024-12-13",
	"weeks52high": 26,
	"weeks52low": 19.870312,
	"alpha": 0.009689,
	"averageVolume10D": 2609,
	"averageVolume20D": 2513,
	"averageVolume30D": 3220,
	"averageVolume50D": 4401,
	"priceToBook": 8.15,
	"priceToCashFlow": 22.4,
	"returnOnEquity": 38.03,
	"returnOnAssets": 13.11,
	"day21MovingAvg": 25.013317,
	"day50MovingAvg": 24.575315,
	"day200MovingAvg": 23.421358,
	"dividend3Years": 0,
	"dividend5Years": 39.04,
	"datatype": "etf",
	"issueType": "CS",
	"close": 25.29,
	"qmdescription": "",
	"__typename": "Company"
}