{
	"symbol": "TRP.PR.B",
	"name": "TC Energy Corporation cumulative redeemable first preferred shares series 3",
	"price": 17.24,
	"priceChange": 0.29,
	"percentChange": 1.710914,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "Energy",
	"industry": "Oil & Gas Storage/Transport",
	"volume": 10300,
	"openPrice": 16.98,
	"dayHigh": 17.24,
	"dayLow": 16.91,
	"MarketCap": 201970531,
	"MarketCapAllClasses": 17917882214,
	"peRatio": 15.55,
	"prevClose": 16.95,
	"dividendFrequency": "Quarterly",
	"dividendYield": 2.456,
	"dividendAmount": 0.105875,
	"dividendCurrency": "CAD",
	"beta": 0.852419,
	"eps": 4.43,
	"exDividendDate": "2025-06-02 00:00:00.0",
	"longDescription": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through five segments: Canadian Natural Gas Pipelines; U.S. Natural Gas Pipelines; Mexico Natural Gas Pipelines; Liquids Pipelines; and Power and Energy Solutions. The company builds and operates a network of 93,700 kilometers of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 532 billion cubic feet. In addition, it has approximately 4,900 kilometers of liquids pipeline system that connects Alberta crude oil pipeline to refining markets in Illinois, Oklahoma, and Texas.",
	"fulldescription": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through five segments: Canadian Natural Gas Pipelines; U.S. Natural Gas Pipelines; Mexico Natural Gas Pipelines; Liquids Pipelines; and Power and Energy Solutions. The company builds and operates a network of 93,700 kilometers of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 532 billion cubic feet. In addition, it has approximately 4,900 kilometers of liquids pipeline system that connects Alberta crude oil pipeline to refining markets in Illinois, Oklahoma, and Texas. Further, the company owns or has interests in seven power generation facilities with a combined capacity of approximately 4,300 megawatts that are powered by natural gas and nuclear fuel sources located in Alberta, Ontario, Quebec, and New Brunswick; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage capacity in Alberta.",
	"website": "https://www.tcenergy.com/",
	"email": "investor_relations@tcenergy.com",
	"phoneNumber": "1-403-920-2000",
	"fullAddress": "450 - 1 Street S.W. Calgary, AB, CA",
	"employees": "6668",
	"shareOutStanding": 11715228,
	"totalDebtToEquity": 2.46,
	"totalSharesOutStanding": 1039320314,
	"sharesESCROW": 0,
	"vwap": 17.0404368,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 17.24,
	"weeks52low": 12.342312,
	"alpha": 0.008923,
	"averageVolume10D": 14942,
	"averageVolume20D": 19823,
	"averageVolume30D": 19794,
	"averageVolume50D": 19880,
	"priceToBook": 2.7,
	"priceToCashFlow": 12.5,
	"returnOnEquity": 16.66,
	"returnOnAssets": 3.56,
	"day21MovingAvg": 16.360476,
	"day50MovingAvg": 15.307907,
	"day200MovingAvg": 14.474078,
	"dividend3Years": 0.47,
	"dividend5Years": 3.07,
	"datatype": "equity",
	"issueType": "PS",
	"close": 17.24,
	"qmdescription": "Oil & Gas Storage/Transport",
	"__typename": "Company"
}