{
	"symbol": "VMO",
	"name": "Vanguard Global Momentum Factor ETF",
	"price": 65.88,
	"priceChange": 0.32,
	"percentChange": 0.488102,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1039,
	"openPrice": 65.82,
	"dayHigh": 66.01,
	"dayLow": 65.82,
	"MarketCap": 191052000,
	"MarketCapAllClasses": 0,
	"peRatio": 19.33,
	"prevClose": 65.56,
	"dividendFrequency": "Annual",
	"dividendYield": 0.774,
	"dividendAmount": 0.512824,
	"dividendCurrency": "CAD",
	"beta": 0.801071,
	"eps": null,
	"exDividendDate": "2023-12-28 00:00:00.0",
	"longDescription": "Vanguard Global Momentum Factor ETF (the ETF) seeks to provide long-term capital appreciation. Fund investing in equity securities that have demonstrated strong recent performance and that are located in developed markets across the world. The ETF employs a proprietary quantitative model to evaluate an investment universe that is composed of large-, mid- and small-capitalization stocks and includes a diverse representation of companies, market sectors and industry groups. The model favours stocks that, when compared with other securities in the investment universe, have relatively strong recent past performance (assessed in terms of both non-risk-adjusted and risk-adjusted return, over shorter (approximately 6 months) and intermediate (approximately 12 months) periods prior to the acquisition of the securities by the ETF) (the Momentum Factor).",
	"fulldescription": "Vanguard Global Momentum Factor ETF (the ETF) seeks to provide long-term capital appreciation. Fund investing in equity securities that have demonstrated strong recent performance and that are located in developed markets across the world. The ETF employs a proprietary quantitative model to evaluate an investment universe that is composed of large-, mid- and small-capitalization stocks and includes a diverse representation of companies, market sectors and industry groups. The model favours stocks that, when compared with other securities in the investment universe, have relatively strong recent past performance (assessed in terms of both non-risk-adjusted and risk-adjusted return, over shorter (approximately 6 months) and intermediate (approximately 12 months) periods prior to the acquisition of the securities by the ETF) (the Momentum Factor). Following subjective analysis of the models output, the investment manager selects securities that provide maximum exposure to the Momentum Factor while taking into account considerations relating to liquidity, portfolio turnover and transaction costs. The investment universe currently consists of equity securities included in the FTSE Developed All Cap Index (the Benchmark) and the Russell 3000 Index.",
	"website": "www.vanguardcanada.ca",
	"email": "",
	"phoneNumber": "888-293-6729",
	"fullAddress": "22 Adelaide St West, Suite 2500, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 2900000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 65.8911111,
	"dividendPayDate": "2024-01-08",
	"weeks52high": 66.68,
	"weeks52low": 46.565808,
	"alpha": 0.00607,
	"averageVolume10D": 1884,
	"averageVolume20D": 2558,
	"averageVolume30D": 2839,
	"averageVolume50D": 2710,
	"priceToBook": 2.34,
	"priceToCashFlow": 8.6,
	"returnOnEquity": 21.67,
	"returnOnAssets": 6.44,
	"day21MovingAvg": 64.183334,
	"day50MovingAvg": 62.4274,
	"day200MovingAvg": 58.2868,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 66.25,
	"qmdescription": "",
	"__typename": "Company"
}