{
	"symbol": "VVL",
	"name": "Vanguard Global Value Factor ETF",
	"price": 54.28,
	"priceChange": 0.52,
	"percentChange": 0.967262,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 2929,
	"openPrice": 54.11,
	"dayHigh": 54.31,
	"dayLow": 54.11,
	"MarketCap": 429897600,
	"MarketCapAllClasses": 0,
	"peRatio": 9.57,
	"prevClose": 53.76,
	"dividendFrequency": "Annual",
	"dividendYield": 2.239,
	"dividendAmount": 1.215328,
	"dividendCurrency": "CAD",
	"beta": 1.138806,
	"eps": null,
	"exDividendDate": "2023-12-28 00:00:00.0",
	"longDescription": "Vanguard Global Value Factor ETF (the ETF) seeks to provide long term capital appreciation. Aiming to capture potential excess return by investing in equity securities that have low prices relative to fundamentals and that are located in developed markets across the world. The ETF employs a proprietary quantitative model to evaluate an investment universe that is composed of large, mid and small capitalization stocks and includes a diverse representation of companies, market sectors and industry groups. The model favours stocks that, when compared with other securities in the investment universe, have lower prices relative to their fundamental measures of value (these measures may include price to book or price to earnings ratio, estimated future earnings and operating cash flow) (the Value Factor).",
	"fulldescription": "Vanguard Global Value Factor ETF (the ETF) seeks to provide long term capital appreciation. Aiming to capture potential excess return by investing in equity securities that have low prices relative to fundamentals and that are located in developed markets across the world. The ETF employs a proprietary quantitative model to evaluate an investment universe that is composed of large, mid and small capitalization stocks and includes a diverse representation of companies, market sectors and industry groups. The model favours stocks that, when compared with other securities in the investment universe, have lower prices relative to their fundamental measures of value (these measures may include price to book or price to earnings ratio, estimated future earnings and operating cash flow) (the Value Factor). Following subjective analysis of the models output, the investment manager selects securities that provide maximum exposure to the Value Factor while taking into account considerations relating to liquidity, portfolio turnover and transaction costs. The investment universe currently consists of equity securities included in the FTSE Developed All Cap Index (the Benchmark) and the Russell 3000 Index.",
	"website": "www.vanguardcanada.ca",
	"email": "",
	"phoneNumber": "888-293-6729",
	"fullAddress": "22 Adelaide St West, Suite 2500, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 7920000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 54.2376923,
	"dividendPayDate": "2024-01-08",
	"weeks52high": 54.32,
	"weeks52low": 43.53,
	"alpha": 0.002861,
	"averageVolume10D": 5187,
	"averageVolume20D": 4671,
	"averageVolume30D": 5856,
	"averageVolume50D": 4899,
	"priceToBook": 1.19,
	"priceToCashFlow": 4.4,
	"returnOnEquity": 17.78,
	"returnOnAssets": 6.54,
	"day21MovingAvg": 52.858093,
	"day50MovingAvg": 51.7274,
	"day200MovingAvg": 49.45645,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 54.28,
	"qmdescription": "",
	"__typename": "Company"
}