{
	"symbol": "VVO",
	"name": "Vanguard Global Minimum Volatility ETF",
	"price": 38.11,
	"priceChange": -0.41,
	"percentChange": -1.064382,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 30488000,
	"MarketCapAllClasses": 0,
	"peRatio": 20.8,
	"prevClose": 38.52,
	"dividendFrequency": "Annual",
	"dividendYield": 2.268,
	"dividendAmount": 0.880586,
	"dividendCurrency": "CAD",
	"beta": 0.68039,
	"eps": null,
	"exDividendDate": "2023-12-28 00:00:00.0",
	"longDescription": "Vanguard Global Minimum Volatility ETF (the ETF) seeks to provide long-term capital appreciation with reduced volatility compared with the global equity market. Fund investing in equity securities from developed and emerging markets across the world. The ETF employs a proprietary quantitative model to evaluate an investment universe that is composed of large-, mid- and small-capitalization stocks and includes a diverse representation of companies, market sectors and industry groups. The model evaluates characteristics designed to measure exposure to a variety of factors that drive a securitys volatility, such as industry sector, liquidity, size, value and growth, with the aim of constructing a portfolio that achieves lower volatility relative to the global equity market, subject to a set of controls (in relation to country, industry, group, sector and individual security concentrations) that are designed to foster portfolio diversification and liquidity.",
	"fulldescription": "Vanguard Global Minimum Volatility ETF (the ETF) seeks to provide long-term capital appreciation with reduced volatility compared with the global equity market. Fund investing in equity securities from developed and emerging markets across the world. The ETF employs a proprietary quantitative model to evaluate an investment universe that is composed of large-, mid- and small-capitalization stocks and includes a diverse representation of companies, market sectors and industry groups. The model evaluates characteristics designed to measure exposure to a variety of factors that drive a securitys volatility, such as industry sector, liquidity, size, value and growth, with the aim of constructing a portfolio that achieves lower volatility relative to the global equity market, subject to a set of controls (in relation to country, industry, group, sector and individual security concentrations) that are designed to foster portfolio diversification and liquidity. The investment universe currently consists of equity securities included in the FTSE Global All Cap Index Hedged to CAD (the Benchmark). The ETF will generally seek to hedge most of its currency exposure, incurred through investing in global stocks, back to the Canadian dollar. However, not all currency risk will be hedged, so the ETF will have some level of currency risk.",
	"website": "www.vanguardcanada.ca",
	"email": "",
	"phoneNumber": "888-293-6729",
	"fullAddress": "22 Adelaide St West, Suite 2500, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 800000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2024-01-08",
	"weeks52high": 38.83,
	"weeks52low": 31.851461,
	"alpha": -0.000752,
	"averageVolume10D": 529,
	"averageVolume20D": 916,
	"averageVolume30D": 1064,
	"averageVolume50D": 863,
	"priceToBook": 3.7,
	"priceToCashFlow": 11.7,
	"returnOnEquity": 19.92,
	"returnOnAssets": 6.94,
	"day21MovingAvg": 38.20381,
	"day50MovingAvg": 38.2026,
	"day200MovingAvg": 36.31255,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 38.83,
	"qmdescription": "",
	"__typename": "Company"
}