{
	"symbol": "XDGH",
	"name": "iShares Core MSCI Global Quality Dividend Index ETF (CAD-Hedged)",
	"price": 27.59,
	"priceChange": -0.26,
	"percentChange": -0.933573,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 808,
	"openPrice": 27.6,
	"dayHigh": 27.6,
	"dayLow": 27.58,
	"MarketCap": 99324000,
	"MarketCapAllClasses": 0,
	"peRatio": 30.04,
	"prevClose": 27.85,
	"dividendFrequency": "Monthly",
	"dividendYield": 2.517,
	"dividendAmount": 0.057,
	"dividendCurrency": "CAD",
	"beta": 0.798699,
	"eps": null,
	"exDividendDate": "2025-06-25 00:00:00.0",
	"longDescription": "The investment objective of the Fund is to provide long term capital growth by replicating, to the extent possible, the performance of the MSCI World High Dividend Yield 100 Percentage Hedged to CAD Index the Index, net of expenses. To achieve its investment objective the fund uses an indexing strategy to achieve its investment objective. Under this strategy, the Fund seeks to replicate the performance of the Index, net of expenses, by employing, directly or indirectly, through investment in one or more iShares ETFs and or through the use of derivatives, a replicating strategy or sampling strategy. A replicating strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a portfolio of index securities in substantially the same proportions as they are represented in the Index.",
	"fulldescription": "The investment objective of the Fund is to provide long term capital growth by replicating, to the extent possible, the performance of the MSCI World High Dividend Yield 100 Percentage Hedged to CAD Index the Index, net of expenses. To achieve its investment objective the fund uses an indexing strategy to achieve its investment objective. Under this strategy, the Fund seeks to replicate the performance of the Index, net of expenses, by employing, directly or indirectly, through investment in one or more iShares ETFs and or through the use of derivatives, a replicating strategy or sampling strategy. A replicating strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a portfolio of index securities in substantially the same proportions as they are represented in the Index. A sampling strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a representative portfolio of securities that has an aggregate investment profile similar to the Index. The securities selected are expected to have, in the aggregate, investment characteristics, fundamental characteristics and liquidity measures similar to those of the Index, as more fully described in the Funds prospectus. The Funds current principal investment strategy is to invest in one or more iShares ETFs. The Fund also employs a currency hedging strategy that seeks to hedge substantially all of the Funds foreign currency back to Canadian dollars.",
	"website": "www.ishares.com",
	"email": "isharesetfs@blackrock.com",
	"phoneNumber": "1-800-474-2737",
	"fullAddress": "iShares, 400 Howard Street, San Francisco, CA, CA",
	"employees": "",
	"shareOutStanding": 3600000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 27.5925,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 28.15,
	"weeks52low": 24.5,
	"alpha": 0.001798,
	"averageVolume10D": 990,
	"averageVolume20D": 1765,
	"averageVolume30D": 1876,
	"averageVolume50D": 2202,
	"priceToBook": 1.25,
	"priceToCashFlow": 10.4,
	"returnOnEquity": 26.63,
	"returnOnAssets": 8.48,
	"day21MovingAvg": 27.270082,
	"day50MovingAvg": 27.037352,
	"day200MovingAvg": 26.8214,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 27.63,
	"qmdescription": "",
	"__typename": "Company"
}