{
	"symbol": "XGB",
	"name": "iShares Core Canadian Government Bond Index ETF",
	"price": 19.14,
	"priceChange": 0.06,
	"percentChange": 0.314465,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 56061,
	"openPrice": 19.06,
	"dayHigh": 19.15,
	"dayLow": 19.05,
	"MarketCap": 1349370000,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 19.08,
	"dividendFrequency": "Monthly",
	"dividendYield": 2.994,
	"dividendAmount": 0.049,
	"dividendCurrency": "CAD",
	"beta": 0.187882,
	"eps": 0.49,
	"exDividendDate": "2024-11-21 00:00:00.0",
	"longDescription": "The investment objective of the Fund is to provide income by replicating, to the extent possible, the performance of the FTSE Canada All Government Bond Index the Index, net of expenses.  The Fund Under normal market conditions, the Fund will primarily invest in Canadian fixed income securities. The Index is a market capitalization-weighted index consisting of a broadly diversified range of government bonds which may include any or all of federal, provincial, corporate and municipal bonds. The securities included in the Index consist primarily of semi-annual pay fixed rate bonds issued domestically in Canada and denominated in Canadian dollars, with an investment grade rating as determined by the index provider and a remaining effective term to maturity of at least one year. The Fund uses an indexing strategy to achieve its investment objective.",
	"fulldescription": "The investment objective of the Fund is to provide income by replicating, to the extent possible, the performance of the FTSE Canada All Government Bond Index the Index, net of expenses.  The Fund Under normal market conditions, the Fund will primarily invest in Canadian fixed income securities. The Index is a market capitalization-weighted index consisting of a broadly diversified range of government bonds which may include any or all of federal, provincial, corporate and municipal bonds. The securities included in the Index consist primarily of semi-annual pay fixed rate bonds issued domestically in Canada and denominated in Canadian dollars, with an investment grade rating as determined by the index provider and a remaining effective term to maturity of at least one year. The Fund uses an indexing strategy to achieve its investment objective. Under this strategy, the Fund seeks to replicate the performance of the Index, net of expenses, by employing, directly or indirectly, through investment in one or more exchange-traded funds managed by BlackRock Canada or an affiliate and/or through the use of derivatives, a replicating strategy or sampling strategy. A replicating strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a portfolio of index securities in substantially the same proportions as they are represented in the Index. A sampling strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a representative portfolio of securities that has an aggregate investment profile similar to the Index. The securities selected are expected to have, in the aggregate, investment characteristics, fundamental characteristics and liquidity measures similar to those of the Index, as more fully described in the Funds prospectus. The Funds current principal investment strategy is to employ a sampling strategy.",
	"website": "www.ishares.com",
	"email": "isharesetfs@blackrock.com",
	"phoneNumber": "1-800-474-2737",
	"fullAddress": "iShares, 400 Howard Street, San Francisco, CA, CA",
	"employees": "",
	"shareOutStanding": 70500000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 19.0980232,
	"dividendPayDate": "2024-12-02",
	"weeks52high": 19.84,
	"weeks52low": 18.38,
	"alpha": -0.000961,
	"averageVolume10D": 53218,
	"averageVolume20D": 52057,
	"averageVolume30D": 47532,
	"averageVolume50D": 45022,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 19.309156,
	"day50MovingAvg": 19.381477,
	"day200MovingAvg": 18.786928,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 19.14,
	"qmdescription": "",
	"__typename": "Company"
}