{
	"symbol": "XSE",
	"name": "iShares Conservative Strategic Fixed Income ETF",
	"price": 17.84,
	"priceChange": -0.04,
	"percentChange": -0.223714,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 278,
	"openPrice": 17.87,
	"dayHigh": 17.87,
	"dayLow": 17.84,
	"MarketCap": 80280000,
	"MarketCapAllClasses": 0,
	"peRatio": 29.68,
	"prevClose": 17.88,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.679,
	"dividendAmount": 0.046,
	"dividendCurrency": "CAD",
	"beta": 0.288012,
	"eps": null,
	"exDividendDate": "2025-06-25 00:00:00.0",
	"longDescription": "The investment objective of the Fund is to generate income for unitholders by investing primarily in securities of one or more exchange traded funds managed by BlackRock Canada or an affiliate iShares ETFs that provide exposure to Canadian and international fixed income securities, including government bonds, investment grade corporate bonds, high yield securities, emerging market debt and other types of fixed income investments, while adhering to certain portfolio constraints upon rebalancing. To achieve fund's objective the Fund In seeking to generate income, the Fund will, upon rebalancing, generally limit its total exposure to high yield securities to 25 Percentage of its portfolio. Exposure to these types of fixed income investments may also be obtained by investing directly in them and or through the use of derivatives. The Fund seeks to hedge any resulting US dollar or other foreign currency exposure, as applicable, back to Canadian dollars.",
	"fulldescription": "The investment objective of the Fund is to generate income for unitholders by investing primarily in securities of one or more exchange traded funds managed by BlackRock Canada or an affiliate iShares ETFs that provide exposure to Canadian and international fixed income securities, including government bonds, investment grade corporate bonds, high yield securities, emerging market debt and other types of fixed income investments, while adhering to certain portfolio constraints upon rebalancing. To achieve fund's objective the Fund In seeking to generate income, the Fund will, upon rebalancing, generally limit its total exposure to high yield securities to 25 Percentage of its portfolio. Exposure to these types of fixed income investments may also be obtained by investing directly in them and or through the use of derivatives. The Fund seeks to hedge any resulting US dollar or other foreign currency exposure, as applicable, back to Canadian dollars. The Fund may invest in, or obtain exposure to, securities denominated in Canadian dollars as well as securities denominated in US dollars and other foreign currencies. The Fund may also invest in derivatives such as options, futures contracts, forward contracts, swaps and debt-like securities to hedge or protect against changes in asset class prices or foreign exchange risks. In constructing the Funds portfolio, BlackRock Canada utilizes a proprietary portfolio optimization process to estimate an efficient portfolio with a total volatility level that is consistent with a broadly diversified portfolio of Canadian fixed income securities. The optimization process is configured to estimate an efficient portfolio with a targeted long-term expected return ranging between Plus 75 and Plus 125 bps above the FTSE Canada Universe Bond Index. The configuration of the optimization process may change from time to time at BlackRock Canadas discretion, subject to the Funds investment objective.",
	"website": "www.ishares.com",
	"email": "isharesetfs@blackrock.com",
	"phoneNumber": "1-800-474-2737",
	"fullAddress": "iShares, 400 Howard Street, San Francisco, CA, CA",
	"employees": "",
	"shareOutStanding": 4500000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 17.855,
	"dividendPayDate": "2025-06-30",
	"weeks52high": 18.38,
	"weeks52low": 16.915033,
	"alpha": -0.002311,
	"averageVolume10D": 2252,
	"averageVolume20D": 3120,
	"averageVolume30D": 2381,
	"averageVolume50D": 3053,
	"priceToBook": 1.81,
	"priceToCashFlow": 3.3,
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 17.826172,
	"day50MovingAvg": 17.787365,
	"day200MovingAvg": 17.726976,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 17.85,
	"qmdescription": "",
	"__typename": "Company"
}