{
	"symbol": "XSHU.U",
	"name": "iShares 1-5 Year U.S. IG Corporate Bond Index ETF",
	"price": 30.63,
	"priceChange": 0.1,
	"percentChange": 0.327547,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 0,
	"openPrice": null,
	"dayHigh": null,
	"dayLow": null,
	"MarketCap": 5053950,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 30.53,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.184,
	"dividendAmount": 0.085,
	"dividendCurrency": "USD",
	"beta": 0.177125,
	"eps": null,
	"exDividendDate": "2024-11-21 00:00:00.0",
	"longDescription": "The investment objective of the Fund is to provide income by replicating, to the extent possible. The Fund Under this strategy, the Fund seeks to replicate the performance of the Index, net of expenses, by employing, directly or indirectly, through investment in one or more iShares ETFs and/or through the use of derivatives, a replicating strategy or sampling strategy. A replicating strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a portfolio of index securities in substantially the same proportions as they are represented in the Index. A sampling strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a representative portfolio of securities that has an aggregate investment profile similar to the Index.",
	"fulldescription": "The investment objective of the Fund is to provide income by replicating, to the extent possible. The Fund Under this strategy, the Fund seeks to replicate the performance of the Index, net of expenses, by employing, directly or indirectly, through investment in one or more iShares ETFs and/or through the use of derivatives, a replicating strategy or sampling strategy. A replicating strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a portfolio of index securities in substantially the same proportions as they are represented in the Index. A sampling strategy is an investment strategy intended to replicate the performance of the Index by investing, directly or indirectly, primarily in a representative portfolio of securities that has an aggregate investment profile similar to the Index. The securities selected are expected to have, in the aggregate, investment characteristics, fundamental characteristics and liquidity measures similar to those of the Index, as more fully described in the Funds prospectus.",
	"website": "www.ishares.com",
	"email": "isharesetfs@blackrock.com",
	"phoneNumber": "1-800-474-2737",
	"fullAddress": "iShares, 400 Howard Street, San Francisco, CA, CA",
	"employees": "",
	"shareOutStanding": 165000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": null,
	"dividendPayDate": "2024-12-02",
	"weeks52high": 31.07,
	"weeks52low": 27.975642,
	"alpha": 0.000738,
	"averageVolume10D": 16,
	"averageVolume20D": 383,
	"averageVolume30D": 339,
	"averageVolume50D": 265,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 30.544258,
	"day50MovingAvg": 30.656294,
	"day200MovingAvg": 29.77897,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "",
	"close": 30.53,
	"qmdescription": "",
	"__typename": "Company"
}