{
	"symbol": "XTR",
	"name": "iShares Diversified Monthly Income ETF",
	"price": 11.35,
	"priceChange": 0.04,
	"percentChange": 0.353669,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 37451,
	"openPrice": 11.31,
	"dayHigh": 11.36,
	"dayLow": 11.31,
	"MarketCap": 375685000,
	"MarketCapAllClasses": 0,
	"peRatio": 15.49,
	"prevClose": 11.31,
	"dividendFrequency": "Monthly",
	"dividendYield": 4.229,
	"dividendAmount": 0.04,
	"dividendCurrency": "CAD",
	"beta": 0.584288,
	"eps": null,
	"exDividendDate": "2024-11-21 00:00:00.0",
	"longDescription": "The investment objective of the Fund is to provide a consistent monthly cash distribution, with the potential for modest long-term capital growth, by investing primarily in exchange-traded funds listed on a recognized Canadian Stock Exchange and managed by BlackRock Canada or an affiliate (Canadian iShares Fund) that provide exposure to a diversified portfolio of income-bearing investments. Exposure to these types of income-bearing investments may also be obtained by investing directly in them and/or through the use of derivatives. To achieve its investment objective the investment strategy of the Fund is to invest primarily in income-bearing Canadian iShares funds. The Fund will invest in a portfolio that is a diversified representation of income-bearing asset classes, including, but not limited to, common equities, fixed income securities and real estate investment trusts. BlackRock Canada will develop and maintain a strategic asset allocation policy for the Fund.",
	"fulldescription": "The investment objective of the Fund is to provide a consistent monthly cash distribution, with the potential for modest long-term capital growth, by investing primarily in exchange-traded funds listed on a recognized Canadian Stock Exchange and managed by BlackRock Canada or an affiliate (Canadian iShares Fund) that provide exposure to a diversified portfolio of income-bearing investments. Exposure to these types of income-bearing investments may also be obtained by investing directly in them and/or through the use of derivatives. To achieve its investment objective the investment strategy of the Fund is to invest primarily in income-bearing Canadian iShares funds. The Fund will invest in a portfolio that is a diversified representation of income-bearing asset classes, including, but not limited to, common equities, fixed income securities and real estate investment trusts. BlackRock Canada will develop and maintain a strategic asset allocation policy for the Fund. The Fund will generally rebalance to this allocation policy on a quarterly basis, but may also do so more frequently if market conditions warrant. The majority of the Funds investment exposure will be to Canadian securities, but foreign asset classes may also be included as a result of their income properties or diversification benefits. BlackRock Canada will review, and may adjust, the Funds strategic asset allocation from time to time, as market conditions change, and as the investible universe evolves.",
	"website": "www.ishares.com",
	"email": "isharesetfs@blackrock.com",
	"phoneNumber": "1-800-474-2737",
	"fullAddress": "iShares, 400 Howard Street, San Francisco, CA, CA",
	"employees": "",
	"shareOutStanding": 33100000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 11.3486559,
	"dividendPayDate": "2024-12-02",
	"weeks52high": 11.4,
	"weeks52low": 10.05,
	"alpha": 0.001277,
	"averageVolume10D": 12010,
	"averageVolume20D": 9495,
	"averageVolume30D": 10062,
	"averageVolume50D": 10146,
	"priceToBook": 2.61,
	"priceToCashFlow": 7.8,
	"returnOnEquity": 23.59,
	"returnOnAssets": 7.66,
	"day21MovingAvg": 11.268692,
	"day50MovingAvg": 11.212621,
	"day200MovingAvg": 10.550927,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 11.35,
	"qmdescription": "",
	"__typename": "Company"
}