{
	"symbol": "XTRA.WT",
	"name": "Xtract One Technologies Inc. Common Share Purchase Warrants",
	"price": 0.22,
	"priceChange": 0.02,
	"percentChange": 10,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 1000,
	"openPrice": 0.225,
	"dayHigh": 0.225,
	"dayLow": 0.22,
	"MarketCap": 3542000,
	"MarketCapAllClasses": 48042113,
	"peRatio": 69,
	"prevClose": 0.2,
	"dividendFrequency": null,
	"dividendYield": null,
	"dividendAmount": null,
	"dividendCurrency": null,
	"beta": -19.194742,
	"eps": null,
	"exDividendDate": "",
	"longDescription": "Xtract One Technologies Inc. engages in the research, development, and commercialization of threat detection solutions worldwide. It operates through Patriot and Xtract segments. The Patriot segment develops and commercializes a platform of artificial intelligence (AI) powered threat detection technologies. The Xtract segment develops and commercializes AI solutions. The company's products include PATSCAN VRS Video Recognition Software that combines digital cameras and artificial intelligence to automate the detection of visible weapon threats, fights, and health and safety issues; and PATSCAN Multi-Sensor Gateway, an autonomous detection system that detects threats on individuals carrying concealed guns, knives, or related threat objects into secured private or public spaces, and can be installed at schools, stadiums, concert halls, shopping centers, and other entryways into private, public, or secured buildings.",
	"fulldescription": "Xtract One Technologies Inc. engages in the research, development, and commercialization of threat detection solutions worldwide. It operates through Patriot and Xtract segments. The Patriot segment develops and commercializes a platform of artificial intelligence (AI) powered threat detection technologies. The Xtract segment develops and commercializes AI solutions. The company's products include PATSCAN VRS Video Recognition Software that combines digital cameras and artificial intelligence to automate the detection of visible weapon threats, fights, and health and safety issues; and PATSCAN Multi-Sensor Gateway, an autonomous detection system that detects threats on individuals carrying concealed guns, knives, or related threat objects into secured private or public spaces, and can be installed at schools, stadiums, concert halls, shopping centers, and other entryways into private, public, or secured buildings. It also develops PATSCAN Cognitive Microwave Radar (CMR), a system to detect concealed guns and knives utilizing microwave radar technology coupled with custom machine learning/AI software. The company was formerly known as Patriot One Technologies Inc. and changed its name to Xtract One Technologies Inc. in December 2022. Xtract One Technologies Inc. was founded in 2016 and is headquartered in Toronto, Canada.",
	"website": "https://www.patriot1tech.com",
	"email": "info@patriot1tech.com",
	"phoneNumber": "+1 888 728-1832",
	"fullAddress": "400 - 257 Adelaide Street West, Toronto, ON, CA",
	"employees": "69",
	"shareOutStanding": 16100000,
	"totalDebtToEquity": 0.03,
	"totalSharesOutStanding": 218373237,
	"sharesESCROW": null,
	"vwap": 0.2225,
	"dividendPayDate": null,
	"weeks52high": 0.255,
	"weeks52low": 0.045,
	"alpha": 0.771631,
	"averageVolume10D": 6350,
	"averageVolume20D": 4150,
	"averageVolume30D": 9383,
	"averageVolume50D": 9154,
	"priceToBook": 10.79,
	"priceToCashFlow": -22,
	"returnOnEquity": 0,
	"returnOnAssets": -54.7,
	"day21MovingAvg": 0.234524,
	"day50MovingAvg": 0.2221,
	"day200MovingAvg": 0.179718,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "equity",
	"issueType": "",
	"close": 0.22,
	"qmdescription": "",
	"__typename": "Company"
}