{
	"symbol": "ZMU",
	"name": "BMO Mid-Term US IG Corporate Bond Hedged to CAD Index ETF",
	"price": 12.75,
	"priceChange": -0.03,
	"percentChange": -0.234742,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 858,
	"openPrice": 12.76,
	"dayHigh": 12.76,
	"dayLow": 12.71,
	"MarketCap": 3152934546,
	"MarketCapAllClasses": 0,
	"peRatio": "",
	"prevClose": 12.78,
	"dividendFrequency": "Monthly",
	"dividendYield": 3.978,
	"dividendAmount": 0.044,
	"dividendCurrency": "CAD",
	"beta": 0.381271,
	"eps": null,
	"exDividendDate": "2025-06-27 00:00:00.0",
	"longDescription": "The ETF seeks to replicate, to the extent possible, the performance of a mid-term U.S. investment grade corporate bond index, net of expenses. Currently, the ETF seeks to replicate the performance of the Bloomberg Barclays US Investment Grade 5 to 10 Year Corporate Bond Capped Index CAD Hedged (the Index).  The investment strategy of the ETF is to obtain exposure to the performance of the Index by investing in assets such as ETFs, mutual funds or other investment funds, American depositary receipts (ADRs) or derivative instruments. The ETF primarily invests in BMO Mid-Term US IG Corporate Bond Index ETF and uses derivative instruments to hedge back to the Canadian dollar. As an alternative to or in conjunction with investing in assets such as ETFs, mutual funds or other investment funds, ADRs or derivative instruments, the ETF may invest in and hold the constituent securities of the Index.",
	"fulldescription": "The ETF seeks to replicate, to the extent possible, the performance of a mid-term U.S. investment grade corporate bond index, net of expenses. Currently, the ETF seeks to replicate the performance of the Bloomberg Barclays US Investment Grade 5 to 10 Year Corporate Bond Capped Index CAD Hedged (the Index).  The investment strategy of the ETF is to obtain exposure to the performance of the Index by investing in assets such as ETFs, mutual funds or other investment funds, American depositary receipts (ADRs) or derivative instruments. The ETF primarily invests in BMO Mid-Term US IG Corporate Bond Index ETF and uses derivative instruments to hedge back to the Canadian dollar. As an alternative to or in conjunction with investing in assets such as ETFs, mutual funds or other investment funds, ADRs or derivative instruments, the ETF may invest in and hold the constituent securities of the Index. The Manager may also use a sampling methodology in selecting investments for the ETF to obtain exposure to the performance of the Index.",
	"website": "www.bmo.com/gam/ca",
	"email": "alternativeproducts@bmo.com",
	"phoneNumber": "+1 8003611392",
	"fullAddress": "43rd Floor, 100 King Street West, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 247288984,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 12.74,
	"dividendPayDate": "2025-07-03",
	"weeks52high": 13.14,
	"weeks52low": 12.23,
	"alpha": -0.002688,
	"averageVolume10D": 5006,
	"averageVolume20D": 5303,
	"averageVolume30D": 6360,
	"averageVolume50D": 6525,
	"priceToBook": null,
	"priceToCashFlow": "",
	"returnOnEquity": "",
	"returnOnAssets": "",
	"day21MovingAvg": 12.656822,
	"day50MovingAvg": 12.561802,
	"day200MovingAvg": 12.435607,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "CE",
	"close": 12.72,
	"qmdescription": "",
	"__typename": "Company"
}