{
	"symbol": "ZUB",
	"name": "BMO Equal Weight US Banks Hedged to CAD Index ETF",
	"price": 34.62,
	"priceChange": -0.33,
	"percentChange": -0.944206,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 6514,
	"openPrice": 34.72,
	"dayHigh": 34.72,
	"dayLow": 34.6,
	"MarketCap": 327032637,
	"MarketCapAllClasses": 0,
	"peRatio": 24.52,
	"prevClose": 34.95,
	"dividendFrequency": "Quarterly",
	"dividendYield": 1.71,
	"dividendAmount": 0.185,
	"dividendCurrency": "CAD",
	"beta": 1.572641,
	"eps": null,
	"exDividendDate": "2025-06-27 00:00:00.0",
	"longDescription": "The ETF seeks to replicate, to the extent possible, the performance of an equal-weight U.S. large-cap banks index, net of expenses. Currently, the ETF seeks to replicate the performance of the Solactive Equal Weight US Bank Index Canadian Dollar Hedged (the Index). The investment strategy of the ETF is to obtain exposure to the performance of the Index by investing in assets such as ETFs, mutual funds or other investment funds, American depositary receipts (ADRs) or derivative instruments. The ETF primarily invests in BMO Equal Weight US Banks Index ETF and uses derivative instruments to hedge back to the Canadian dollar. As an alternative to or in conjunction with investing primarily in assets such as ETFs, mutual funds or other investment funds, ADRs or derivative instruments, the ETF may invest in and hold the constituent securities of the Index in the same proportion as they are reflected in the Index.",
	"fulldescription": "The ETF seeks to replicate, to the extent possible, the performance of an equal-weight U.S. large-cap banks index, net of expenses. Currently, the ETF seeks to replicate the performance of the Solactive Equal Weight US Bank Index Canadian Dollar Hedged (the Index). The investment strategy of the ETF is to obtain exposure to the performance of the Index by investing in assets such as ETFs, mutual funds or other investment funds, American depositary receipts (ADRs) or derivative instruments. The ETF primarily invests in BMO Equal Weight US Banks Index ETF and uses derivative instruments to hedge back to the Canadian dollar. As an alternative to or in conjunction with investing primarily in assets such as ETFs, mutual funds or other investment funds, ADRs or derivative instruments, the ETF may invest in and hold the constituent securities of the Index in the same proportion as they are reflected in the Index. The Manager may also use a sampling methodology in selecting investments for the ETF to obtain exposure to the performance of the Index.",
	"website": "www.bmo.com/gam/ca",
	"email": "alternativeproducts@bmo.com",
	"phoneNumber": "+1 8003611392",
	"fullAddress": "43rd Floor, 100 King Street West, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 9446350,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 34.6748437,
	"dividendPayDate": "2025-07-03",
	"weeks52high": 36.1,
	"weeks52low": 24.72,
	"alpha": -0.000955,
	"averageVolume10D": 120580,
	"averageVolume20D": 98633,
	"averageVolume30D": 92717,
	"averageVolume50D": 130719,
	"priceToBook": 1.03,
	"priceToCashFlow": "",
	"returnOnEquity": 12.66,
	"returnOnAssets": 1.04,
	"day21MovingAvg": 32.083443,
	"day50MovingAvg": 30.965849,
	"day200MovingAvg": 31.342262,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 34.61,
	"qmdescription": "",
	"__typename": "Company"
}