{
	"symbol": "ZWP",
	"name": "BMO Europe High Dividend Covered Call ETF",
	"price": 19.15,
	"priceChange": 0.02,
	"percentChange": 0.104548,
	"exchangeName": "Toronto Stock Exchange",
	"exShortName": "TSX",
	"exchangeCode": "TSX",
	"marketPlace": null,
	"sector": "",
	"industry": "",
	"volume": 12554,
	"openPrice": 19.03,
	"dayHigh": 19.16,
	"dayLow": 19.03,
	"MarketCap": 929732500,
	"MarketCapAllClasses": 0,
	"peRatio": 6.29,
	"prevClose": 19.13,
	"dividendFrequency": "Monthly",
	"dividendYield": 6.59,
	"dividendAmount": 0.105,
	"dividendCurrency": "CAD",
	"beta": 0.700781,
	"eps": null,
	"exDividendDate": "2025-06-27 00:00:00.0",
	"longDescription": "The ETF seeks to provide exposure to the performance of a portfolio of dividend paying European companies to generate income and to provide long-term capital appreciation, while mitigating downside risk through the use of covered call options. The ETF will primarily invest in and hold the equity securities of dividend paying European companies. Securities will be selected using a rules based methodology that considers dividend growth, yield, and payout ratio. Securities will also be subject to a screening process to ensure sufficient liquidity. Depending on market volatility and other factors, the ETF will write covered call options on these securities. Under such call options, the ETF will sell to the buyer of the option, for a premium, either a right to buy the security at an exercise price or, if the option is cash settled, the right to a payment equal to the difference between the value of the security and the exercise price.",
	"fulldescription": "The ETF seeks to provide exposure to the performance of a portfolio of dividend paying European companies to generate income and to provide long-term capital appreciation, while mitigating downside risk through the use of covered call options. The ETF will primarily invest in and hold the equity securities of dividend paying European companies. Securities will be selected using a rules based methodology that considers dividend growth, yield, and payout ratio. Securities will also be subject to a screening process to ensure sufficient liquidity. Depending on market volatility and other factors, the ETF will write covered call options on these securities. Under such call options, the ETF will sell to the buyer of the option, for a premium, either a right to buy the security at an exercise price or, if the option is cash settled, the right to a payment equal to the difference between the value of the security and the exercise price. Covered call options partially hedge against a decline in the price of the securities on which they are written to the extent of the premiums received by the ETF at the time the options are written by the ETF. The call options written by the ETF may be either exchange traded options or over-thecounter options.",
	"website": "www.bmo.com/gam/ca",
	"email": "alternativeproducts@bmo.com",
	"phoneNumber": "+1 8003611392",
	"fullAddress": "43rd Floor, 100 King Street West, Toronto, ON, CA",
	"employees": "",
	"shareOutStanding": 48550000,
	"totalDebtToEquity": "",
	"totalSharesOutStanding": 0,
	"sharesESCROW": null,
	"vwap": 19.1073999,
	"dividendPayDate": "2025-07-03",
	"weeks52high": 20,
	"weeks52low": 16.84,
	"alpha": 0.002554,
	"averageVolume10D": 23640,
	"averageVolume20D": 22284,
	"averageVolume30D": 23822,
	"averageVolume50D": 25456,
	"priceToBook": 1.99,
	"priceToCashFlow": 8.7,
	"returnOnEquity": 24.08,
	"returnOnAssets": 7.44,
	"day21MovingAvg": 18.884216,
	"day50MovingAvg": 18.824417,
	"day200MovingAvg": 18.069653,
	"dividend3Years": "",
	"dividend5Years": "",
	"datatype": "etf",
	"issueType": "ET",
	"close": 19.12,
	"qmdescription": "",
	"__typename": "Company"
}